{"url": "https://www.bbc.com/news/uk-18996860", "title": "Police numbers at nine-year low", "description": "The number of police officers in England and Wales has fallen by more than 5,000 in the past year, Home Office figures reveal.", "content": "Police officer numbers in England and Wales have fallen to their lowest level in nine years, the Home Office says.\n\nFull-time equivalent (FTE) officers in the 43 forces stood at 134,101 at the end of March - a fall of 5,009 officers (3.6%) compared to a year earlier.\n\nThe biggest percentage drops were in Derbyshire (10%) and Warwickshire (8.2%), while Surrey saw a 4.7% rise.\n\nThe overall number of community support officers fell 9% to 14,393, the Home Office figures also showed.\n\nBut the number of volunteer special constables was up 10.4% to 20,343.\n\nPolicing and Criminal Justice Minister Nick Herbert said the reduced numbers were a result of \"necessary savings\" as part of the deficit reduction programme.\n\nHe added that service to the public was \"largely being maintained\" and projections showed 94% of officers would remain on the front line - and the proportion was rising.\n\n\"We inherited a situation where there were some 25,000 officers not on the front line,\" he said.\n\n\"So there was plenty of scope for forces to make savings while improving performance, as forces are showing as they continue to drive down crime.\"\n\nBut Paul McKeever, chairman of the Police Federation of England and Wales, which represents rank-and-file officers, said the figures \"do nothing to reassure us or the public we serve\", and urged the government not to \"gamble\" with public safety.\n\n\"Despite accusations that we were scaremongering, the harsh reality of the consequences of a 20% cut to the police budget is now hitting home.\n\n\"We are on the cusp of hosting the biggest event this country has ever seen and already... police officers have been required to step in at the 11th hour to put public safety first,\" he added.\n\nShadow police minister David Hanson said it was \"deeply worrying\" that nearly 10,000 officers had already been lost to budget cuts since the last general election.\n\nHe told the BBC \"boots on the street\" were under threat at a time when there were growing challenges for forces to keep crime at \"historic levels\" following falls over 15 years.\n\nThe total number of officers in Derbyshire fell by 202 and Warwickshire had 75 fewer, while Surrey had 89 more - the only force to see an increase.\n\nThe largest numerical decrease was in the West Midlands - down 323 officers (4%).\n\nIn South Wales, officer numbers were down 6.2% to 2,907, while in North Wales numbers dropped 4.9% to 1,454.\n\nGwent saw officer numbers shrink by 3.7% to 1,446 and Dyfed-Powys by 2.3% to 1,131."}