{"url": "https://www.bbc.com/news/world-latin-america-43823287", "title": "Cuba leader: 'No room for capitalism'", "description": "For the first time in decades, Cuba has a leader who is not a Castro - but don't expect big changes.", "content": "Miguel Díaz-Canel has been sworn in as Cuba's new president, replacing Raúl Castro who took over from his ailing brother Fidel in 2006.\n\nIt is the first time since the revolution in 1959 that a Castro is not at the helm of the government.\n\nMr Díaz-Canel had been serving as first vice-president for the past five years.\n\nEven though Mr Díaz-Canel was born after the revolution, he is a staunch ally of Raúl Castro and is not expected to make any radical changes.\n\nThere was \"no room in Cuba for those who strive for the restoration of capitalism\" he said in his inaugural address.\n\nHe was elected by the members of the National Assembly, all 605 of whom were voted in in March after standing unopposed.\n\nMr Castro is expected to continue wielding considerable political influence in his role as the leader of Cuba's ruling Communist Party.\n\nCuba's new President, Miguel Díaz-Canel, entered the chamber alongside the outgoing president, Raúl Castro.\n\nThe moment captured the image of political continuity the Cuban government has been keen to stress: an ordered handover of power from one generation to the next.\n\nThere was a small surprise, a single dissenting vote to Díaz-Canel's nomination as president, as he was confirmed by just 99.83% of the vote.\n\nStill, he had the one and only ballot he really needed: Raúl Castro's.\n\nIn his inaugural speech, Mr Díaz-Canel said that his mandate was \"to ensure the continuity of the Cuban revolution at a key historic moment\" and assured the members of the National Assembly that \"the revolution continues its course\".\n\nHe said that Cuba's foreign policy would remain \"unaltered\" and that any \"necessary changes\" would be decided by the Cuban people.\n\nA large part of his speech was dedicated to praising his predecessor in office, to whom he said: \"Cuba needs you.\" This prompted the more than 600 National Assembly members to rise to their feet and give the 86-year-old former leader a standing ovation.\n\nAny changes Mr Díaz-Canel will bring in are likely to be gradual, slow-paced and in keeping with the reforms Raúl Castro introduced since he first took over power from his brother, Fidel.\n\n2008: New agricultural strategy is launched, promising to grant a million hectares of land to private farmers\n\n2010: Loosening of rules governing business activities, allowing Cubans to set up their own small private businesses\n\n2011: Opening up of the housing market, allowing Cubans to buy and sell their homes\n\n2013: First wi-fi zones created as part of a push to make the internet more accessible for Cubans\n\n2014: US-Cuban thaw announced leading to the restoration of full diplomatic relations between the former foes\n\nThe new leader will have to consider how to overcome the problems caused by the economic collapse of Cuba's ally, Venezuela, and what kind of relationship the Caribbean island wants with the US under Donald Trump.\n\nLast year, the new American president reimposed certain travel and trade restrictions eased by the Obama administration but did not reverse key diplomatic and commercial ties.\n\nBut what most Cubans will judge the new leader on is whether their day-to-day lives improve."}