{"url": "https://www.bbc.com/sport/football/43720956", "title": "Bournemouth 0-2 Manchester United", "description": "Manchester United's 2-0 win at Bournemouth proves the players want to feature in the FA Cup semi-final with Tottenham, says manager Jose Mourinho.", "content": "Manchester United's \"professional\" 2-0 win at Bournemouth proved the players want to feature in Saturday's FA Cup semi-final with Tottenham, according to manager Jose Mourinho.\n\nMourinho made seven changes to his side as United bounced back from Sunday's surprise home defeat by bottom club West Brom.\n\nChris Smalling and substitute Romelu Lukaku scored in either half at the Vitality Stadium to give United a four-point lead over third-place Liverpool in the table, with four games remaining.\n\nMourinho had described this match as an opportunity for players to secure a place in the team to face Spurs in a competition which represents United's final chance of winning a trophy this season.\n\nHe said Lukaku, Antonio Valencia, who was rested, and Nemanja Matic would return to the starting line-up at Wembley, while others had given him plenty to think about.\n\n\"I will not play this XI but all of them told me they want to play,\" said Mourinho.\n\n\"This win was based on good attitude, professionalism and a determination to win an important match for us because now it's difficult to not finish in the top four.\"\n\nThis was the reaction Mourinho demanded after the deflating result against West Brom, which confirmed neighbours Manchester City as champions.\n\nWith the title gone and patience running thin, Luke Shaw, Marouane Fellaini and Matteo Darmian were among those recalled while goalkeeper David de Gea, who captained the side, Smalling, Ander Herrera and Paul Pogba were the only survivors from the weekend.\n\nThis was far from vintage United yet it was an improvement on the performance against West Brom, which Mourinho described as \"complicated\".\n\nIn contrast to Sunday, Pogba was solid, if unspectacular, while Herrera's defence-splitting ball for Lingard to tee up Smalling to slide in for the opener was the pass of the night.\n\nLingard has a healthy goalscoring record at Wembley and his energetic performance against Bournemouth might earn him a starting place against Spurs.\n\nUnited's 49th competitive game of the season had an end-of-season feel about it but their goals were well crafted and the points hard earned.\n\nLukaku's finish, eight minutes after replacing Lingard, came after a driving run and pass by Pogba.\n\nBournemouth have now won only one of their past nine league games but, barring a spectacular sequence of results, they will be playing in the Premier League for a fourth successive season.\n\nThat in itself is a tremendous achievement for boss Eddie Howe and his players.\n\nThe Cherries, 11th in the table, are 10 points above the relegation zone, although they have played two games more than some of the teams below them.\n\n\"We're not quite safe - I'm getting bored of saying it. We have three massive games left and we need to get over the line,\" said Howe, whose side have beaten Arsenal and Chelsea in 2018.\n\nOn another day, Callum Wilson might have won a penalty. With the score 1-0, Shaw appeared to make contact as the Bournemouth striker failed to divert Joshua King's cross over the line, before Lukaku's 16th league goal of the season ended the home side's hopes of a fightback.\n\n\"We gave everything. We were decent for large spells,\" added Howe.\n\n\"United didn't have a huge amount of chances either but took their goals well. You have to admire the quality of the opposition at times.\"\n\nBournemouth are not in action again until 28 April when they travel to face Southampton in the Premier League (15:00 BST). Manchester United will look to keep alive their hopes of ending the season with a trophy when they face Tottenham at Wembley in the FA Cup semi-final on Saturday (17:15 BST)."}