{"url": "https://www.bbc.com/news/uk-wales-south-east-wales-44493847?intlink_from_url=&link_location=live-reporting-story", "title": "Severn Tunnel to shut for three weeks", "description": "Rail passengers travelling between south Wales and London face longer journey times.", "content": "Rail passengers travelling between south Wales and London face longer journey times for the next three weeks as the Severn Tunnel will be closed.\n\nMain line services between Swansea and London Paddington will take 40 minutes longer as trains will be diverted via Gloucester from Saturday until 6 July.\n\nGreat Western Railway said those trains will not call at Bristol Parkway.\n\nThe closure is due to a £2.8bn project to electrify the south Wales main line for GWR's new electric trains.\n\nCommuters between Bristol and south Wales will be forced to take a rail-replacement bus service.\n\nTrains between England's south coast and Wales will start and end at Bristol Parkway, with buses linking to Newport.\n\nOn Sunday, there will be no direct trains between south Wales and London with all services starting and terminating at Bristol Parkway.\n\nReplacement coaches will run to Newport for trains to Cardiff and Swansea.\n\nThe work will affect passengers going to major events in south Wales such as England's cricket matches in Cardiff as they face Australia on Saturday and India next month.\n\nFans going to four Ed Sheeran concerts at the Principality Stadium next week may also be affected by the works.\n\nThe track inside the four-mile Severn Tunnel is to be renewed, while \"further electrification works\" are planned. The track will also be lowered in the two Patchway tunnels.\n\nFor passengers a bus service will replace trains between Bristol Parkway and Newport and stop at Patchway and Severn Tunnel Junction.\n\nTrains will continue to run as normal between London Paddington and Bristol Temple Meads via Bath, but there will only be one direct service an hour from London to Bristol Parkway."}