{"url": "https://www.bbc.com/sport/football/39611661", "title": "Barcelona 0-0 Juventus (agg 0-3)", "description": "Juventus reach the semi-finals of the Champions League after stopping Barcelona from scoring at the Nou Camp.", "content": "Juventus produced an exceptional defensive performance to reach the semi-finals of the Champions League after stopping Barcelona from scoring at the Nou Camp.\n\nTrailing 3-0 from the first leg, Barca peppered the Italian goal but failed to repeat their last-16 heroics when they overturned a first-leg 4-0 deficit to beat Paris St-Germain.\n\nLionel Messi, who had earlier been denied by Gianluigi Buffon, fired wastefully over the bar while Luis Suarez and Neymar also spurned chances on a night Barca were restricted to one shot on target.\n\nJuve's Gonzalo Higuain fired tamely at Marc-Andre ter Stegen and Juan Cuadrado missed another chance but the final whistle was celebrated wildly by the champions of Italy, who have not conceded a single goal from open play in this season's Champions League.\n\nJuventus join Real Madrid, Atletico Madrid and Monaco in Friday's last-four draw (from 11:00 BST).\n\nThe champions of Italy are 180 minutes away from the final in Cardiff on 3 June after a superb defensive performance as Barca and their formidable strike force failed to score over two legs.\n\nJuventus join Manchester United (2007-08) and Bayern Munich (2012-13) as one of only three teams that have stopped the Catalans scoring in both legs of a Champions League tie.\n\nThey were as brave and aggressive as they were calm and disciplined with Leonardo Bonucci and Giorgio Chiellini monumental at the heart of the defence.\n\nWhen Barca did manage to carve out chances, Suarez, Messi and Neymar failed to deliver.\n\nAll three had chances before the interval. In the space of a few minutes, Suarez had a goal-bound shot blocked, Messi dragged a chance from 12 yards and Neymar volleyed wide.\n\nIt said everything about Juve's defensive display that Buffon only had one save to make, the 39-year-old denying Messi before the Barca forward hammered the rebound into the side-netting.\n\nYet Juve, as adventurous going forward as they were solid at the back, might have beaten the Spanish champions for the second time in a week.\n\nHiguain should have done better from close range after a ball over the top before Cuadrado flashed a chance narrowly wide on the counter.\n\nIn the end it did not matter, Juve and their travelling fans celebrated a night to remember.\n\nBarca boss Luis Enrique will leave the Nou Camp this summer having failed to reach the semi-finals for a second successive season.\n\nThis was every bit as painful as their exit at the hands of La Liga rivals Atletico Madrid at the same stage 12 months ago.\n\nThey had 19 shots on the night - yet only one on target as Juve avenged their defeat against the same opponents in the 2015 final.\n\nNeymar, who scored twice in the 6-1 return leg win over Paris St-Germain in the previous round, ended this game in tears with Barcelona's season in danger of falling flat.\n\nThey face Real Madrid in El Clasico on Sunday (19:45 BST) knowing defeat will leave them six points behind the leaders, who have a game in hand.\n\nBarca are in the final of the Copa del Rey but Enrique knows that even if his side beat Alaves on 27 May, it will be scant consolation if they fail to win La Liga following another disappointing European campaign."}