{"url": "https://www.bbc.com/sport/snooker/32289287", "title": "World Snooker Championship: Mark Selby plays Kurt Maflin", "description": "Mark Selby begins the defence of his World Championship title against Kurt Maflin, who beat Steve Davis in qualifying.", "content": "Defending champion Mark Selby faces Kurt Maflin, who beat Steve Davis in qualifying, in the first round of the World Championship at the Crucible.\n\nSelby, 31, won his first world title in 2014 after beating Ronnie O'Sullivan, who takes on debutant Craig Steadman.\n\nIt is a tough draw for the Englishman, coming up against Maflin, a renowned break-builder who has two maximum 147 breaks to his name. The Norwegian is one of four debutants competing on the main stage.\n\n\"Players in the past have struggled, first rounds are always difficult,\" said six-time champion Davis, who conducted the draw at the Hallamshire Golf Club.\n\n\"But Mark Selby is a very balanced player mentally, so I don't expect him to have problems.\"\n\nMeanwhile, five-time World Championship winner O'Sullivan will fancy his chances against 32-year-old Englishman Steadman, another who will play at the Sheffield venue for the first time.\n\n\"The one tie that hits me is Ronnie against the debutant. A pressure match for both players. One with everything to lose, one with everything to gain,\" said World Snooker chairman Barry Hearn.\n\nThe Rocket has gone out in the first round three previous times, but has reached the final for the last three years. Second seed O'Sullivan could set up a repeat of last year's showpiece if both he and Selby progress.\n\nThe other stand-out tie is an all-Welsh clash between the much-improved Mark Williams, a two-time champion, and two-time runner-up Matthew Stevens, while an all-Scottish match sees Stephen Maguire come up against Anthony McGill - another making his first appearance.\n\nSheffield will host a festival of live BBC programmes and free events to celebrate the World Snooker Championship."}