{"url": "https://www.bbc.com/sport/football/32850696", "title": "Louis van Gaal 'believes' David De Gea will stay at Man Utd", "description": "Manchester United boss Louis van Gaal \"believes\" goalkeeper David De Gea will stay at the club next season.", "content": "Manager Louis van Gaal says he is optimistic about keeping goalkeeper David De Gea at Manchester United.\n\nReal Madrid are understood to be interested in signing Spaniard De Gea, who has one more season left on his contract at Old Trafford.\n\nThe 24-year-old waved to United fans as he left the pitch on Sunday after suffering an injury in the 1-1 draw against Arsenal.\n\nBut Van Gaal said: \"I believe still that David De Gea shall stay.\"\n\nUnited's player of the season is in contention to start the final match of the season at Hull on Sunday (15:00 BST kick-off) despite the hamstring injury he suffered against the Gunners.\n\nThe Old Trafford club brought in fellow Spaniard Victor Valdes, 33, from Barcelona in January and he made his debut when he replaced De Gea on Sunday.\n\nLeft-back Luke Shaw was left out of the England Under-21 squad to play in the European Championships when it was announced on Wednesday - with manager Gareth Southgate saying that he was \"medically not fit\".\n\nVan Gaal previously said he did not want Shaw to be included with the 19-year-old experiencing an injury-disrupted campaign since joining United from Southampton in June 2014.\n\nThe Dutchman said: \"I have read I'm the winner of the debate but that's not like that. The winner is Luke Shaw because we have to develop great talents.\n\n\"It was maybe too fast this step from Southampton to Manchester United and we have to protect that.\"\n\nDe Gea is not the only player at United whose future is unclear.\n\nForwards Radamel Falcao, Robin van Persie and Nani, as well as defender Rafael, are among those who could face an uncertain summer.\n\nVan Gaal said: \"I shall talk with them maybe tomorrow [on Saturday]. We have a farewell drink after the match. I have the Monday to talk. I shall do that.\n\n\"You have to wait and see how these talks develop in staying or going away.\"\n\nVan Gaal gave a memorable speech at United's player of the year awards evening on Monday.\n\nThe Dutch coach shouted: \"Hello, hello, pay attention to the manager!\" before admonishing the audience for not applauding the female saxophonist, who he said had played \"fantastically\".\n\nWhen asked about it on Friday, Van Gaal said: \"I say something [about] how the season has developed in my opinion - and of course with a story and with reasons.\n\n\"I tell in my own words and I'm doing that always with passion. I love the fans because I have said many times that they showed their belief in me a lot of times so I'm like that.\""}