{"url": "https://www.bbc.com/sport/football/25463249", "title": "Luis Suarez signs new long-term Liverpool deal", "description": "Uruguay striker Luis Suarez signs a new four-and-a-half-year deal at Liverpool that will eventually see him earn £200,000 per week.", "content": "Luis Suarez has signed a new four-and-a-half-year contract with Liverpool.\n\nThe striker, 26, joined the Reds in January 2011 and has scored 17 goals in 11 Premier League starts this season.\n\nSuarez, whose original deal was set to expire in 2016, will earn around £160,000 until the end of this season and then £200,000 per week over the final four years of the contract.\n\n\"I am delighted to have agreed a new deal with Liverpool and have my future secured for the long term,\" he said.\n\n2011: January - Liverpool agree a deal worth up to £22.8m with Ajax for Suarez February - Scores on his Liverpool debut as the Reds beat Stoke 2-0 December - The Football Association bans Suarez for eight matches and fines him £40,000 after he was charged with racially abusing Manchester United's Patrice Evra 2012: February - Suarez appears to refuse to shake Evra's hand on his return to Liverpool's first XI. He goes on to score in the Reds' 2-1 loss to Manchester United 2013: April - Receives a 10-game ban from an independent regulatory commission for biting Chelsea defender Branislav Ivanovic in a match on 21 April September: Returns from his 10-match ban in a League Cup tie at Manchester United December: Scores twice against Tottenham to take his tally to 17 goals in 12 games for the season\n\n\"I believe I can achieve the ambitions of winning trophies and playing at the very highest level with Liverpool. My aim is to help get us there as quickly as possible.\"\n\nSuarez admitted his close bond with Liverpool's fans was an important factor in his decision, particularly their backing during his 10-match ban for biting Chelsea's Branislav Ivanovic earlier this year.\n\nHe told Liverpool TV: \"I love the city and the supporters. They have helped me and I try my best on the pitch.\n\n\"It was a difficult time after the summer, but they helped me come back and play and I think when supporters help you off the pitch you try your best to make them happy on the pitch.\"\n\nHe also revealed that manager Brendan Rodgers played an influential role in persuading him to pledge his immediate future to Liverpool.\n\n\"He was very important. When you have confidence with the manager you can try your best,\" he said.\n\n\"When the team is together and you are happy in the dressing room, that makes me happy.\"\n\nSuarez's relationship with leading figures at Anfield has improved significantly since he attempted to force a move to Arsenal in the summer.\n\nThe Gunners made two bids for the Uruguay international, including a club-record offer of £40m plus £1 in an attempt to trigger a release clause in his contract.\n\nBoth were rejected, with Liverpool boss Rodgers accusing Arsenal of \"playing games\".\n\nSuarez was considering submitting a formal transfer request and also the possibility of court action if the dispute was not resolved as he believed the second bid triggered a clause in his contract that allowed him to leave the Anfield club.\n\nSuarez was initially made to train alone during pre-season, but returned to the first-team fold on 16 August after talks with Rodgers.\n\n\"This is fantastic news for everyone associated with the club; the team, the owners and most importantly the supporters,\" Rodgers said on Liverpool's official website.\n\n\"Luis is a world-class talent and securing his services is crucial for what we are trying to achieve here.\n\n\"What's most important and most exciting is that, at just 26 years old, his best years are still ahead of him and we now know we'll be seeing him reach that potential in a Liverpool shirt.\"\n\nSuarez's time at Liverpool has often been controversial and he has previously been handed handed two long-term bans.\n\nHe was banned for eight games in December 2011 for racially abusing Manchester United's Patrice Evra before receiving his 10-match ban in April for the incident with Ivanovic."}