{"url": "https://www.bbc.com/sport/football/25647442", "title": "Are brilliant Bayern Munich making the Bundesliga boring?", "description": "Bundesliga clubs have spent the winter break asking themselves: \"How can we stop Bayern Munich?\"", "content": "The German top-flight's winter break should have been about rest and recuperation for Bundesliga players and coaches.\n\nBut one question will have been driving them to distraction: how can we compete with Bayern Munich?\n\nAfter a five-week absence, the Bundesliga returns on Friday when the leaders - and defending champions - travel to Borussia Monchengladbach.\n\nPep Guardiola's men are seven points ahead of nearest rivals Bayer Leverkusen, with last season's runners-up Borussia Dortmund 12 points adrift in fourth, as the second half of the campaign kicks off.\n\nAnd, in a further demonstration of their power, the Champions League and Club World Cup holders announced earlier this month that Dortmund's prized asset Robert Lewandowski will join them in the summer.\n\n\"Bayern aren't from this world at the moment,\" Leverkusen sporting director and former Germany forward Rudi Voller told BBC Sport.\n\n\"The danger is very real that it will be boring at the top.\"\n\nIn 2013, Bayern broke records, won five trophies and hired one of the world's best coaches when Guardiola replaced the retiring Jupp Heynckes.\n\nSo let's put their domination in the context of English football. Since Bayern last lost in the Bundesliga, Chelsea have had three managers. English Premier League clubs have spent more £600m in transfer fees. A total of 14 players have made their international debuts for England.\n\nThat last Bundesliga defeat was way back in October 2012, when Sidney Sam's late header gave Leverkusen a 2-1 victory at the Allianz Arena.\n\n\"Bayern are playing a similar role to the one Barcelona played in Spain - they're virtually unbeatable and outplay most opponents,\" says Voller, who scored 47 goals in 90 games for Germany between 1982 and 1994.\n\n\"Borussia Dortmund have managed to battle back a little bit over the last few years, but not this year.\n\n\"This season, we have been close in terms of points, but Bayern's quality is not just in their starting 11 but also in the 11 after that. It is so high.\"\n\nVoller was one of the greatest strikers in the history of German football and coached the national team when they reached the 2002 World Cup final.\n\nThis season, he watched from the stands as head coach Sami Hyypia guided Leverkusen to a 1-1 home draw against Bayern.\n\nSince then, Leverkusen have overtaken Dortmund as Bayern's closest rivals at the top, but Voller admits the battles in other areas of the table are becoming more exciting than the title race.\n\n\"What's important is that there are other groups that are interesting,\" he adds. \"Those playing for the Champions League spots, the Europa League places or the relegation candidates for example. That keeps the league exciting.\"\n\nIn the last 10 years, four teams have managed to beat Bayern to the Bundesliga title: Werder Bremen (2003-4), Stuttgart (2006-7), Wolfsburg (2008-9) and Dortmund (2010-11 and 2011-12).\n\nLast season, though, second-placed Dortmund finished 25 points behind Bayern - and all four of those teams are now wondering how they are ever going to catch the reigning champions again.\n\n\"To be honest that's the most difficult question within the Bundesliga at the moment,\" says Stuttgart sporting director Jochen Schneider. \"Bayern are far, far away from every other team, so it's quite difficult.\n\n\"One team dominating in that way is something we can't like, but remember it happened also in the 70s and the 80s when Bayern Munich dominated for a certain period.\n\n\"It's going to be very tough to win the title again but when we look back to 2006, the year before we last won the league, it was nearly the same situation - so in football, everything can happen.\n\n\"We have to work hard every day. We have won the title five times in the history of the club and I'm quite sure we will win it again.\"\n\nOn the pitch, the Stuttgart players are also feeling the strain of trying to compete with Bayern.\n\nThey narrowly lost the German Cup final 3-2 to the treble winners in May and will play them for the first time this season on 29 January.\n\n\"I think for the moment, there's no chance against Bayern Munich,\" Stuttgart and Guinea winger Ibrahima Traore told BBC Sport.\n\n\"They are too good, they have too much quality, they have too many players who can make a difference in every game. I think in the league no team can beat them. That's how I feel.\n\n\"I don't think their dominance is good for the Bundesliga but what can we do against them? They're strong, they're powerful and they can play. Every team is starting to aim for second place, not for the title.\"\n\nThe other problem for Bayern's rivals is that the Bavarian side have the power and the money to sign all of the best young talents in Germany after they have been developed at other clubs.\n\nThe prime example is Mario Gotze, who started training with Borussia Dortmund at just eight years of age.\n\nAfter moving from the academy to the first team he helped Dortmund win two Bundesliga titles and reach a Champions League final.\n\nBut last April, Bayern came calling with a £31.5m bid and Gotze controversially moved from the Westfalenstadion to the Allianz Arena last summer.\n\nThen, to add insult to injury for Dortmund fans, Poland striker Lewandowski signed a pre-contract agreement to join Bayern in the summer.\n\nStuttgart also have one of the most successful youth academies in the country, producing Germany internationals Sami Khedira and Mario Gomez among others, but their sporting director agrees that it is difficult to begrudge Bayern for their success or their spending power.\n\n\"Sometimes it's a bit frustrating but on the other hand they've done a very good job for 40 years, it's the best club in Germany,\" Schneider says.\n\n\"And it's not that they won the money in the lottery or that a Russian guy came to give them lots of money - it's the result of their work. It's something you have to accept.\n\n\"It's our job to close that gap and we're working on that.\""}