{"url": "https://www.bbc.com/sport/football/23056298", "title": "Carlos Tevez: Manchester City striker moves to Juventus", "description": "Manchester City's Argentine striker Carlos Tevez joins Italian champions Juventus in a deal worth £12m.", "content": "Manchester City striker Carlos Tevez has completed his £12m move to Italian champions Juventus.\n\nCity and Juve agreed a deal of £10m that could rise by £2m with add-ons.\n\n27 September, 2011: City lose 2-0 to Bayern Munich with Tevez accused of refusing to warm up to go on as substitute 27 September: Roberto Mancini says Tevez is finished with Manchester City 28 October: Fined two weeks' wages for breach of contract related to Bayern game (£400,000) 7 November: Tevez flies to Argentina without the club's permission 22 December: City charge Tevez with gross misconduct for his actions since 7 November. (Six weeks' fine: £1.2m). Given until 7 January to appeal 21 March: Tevez returns for City as substitute in the 2-1 win against Chelsea\n\nThe Argentina international, 29, arrived in Italy on Wednesday for a medical and signed a three-year contract.\n\nWhen the fee is combined with wages and bonuses due to Tevez in the final year of his contract, City could save about £27m.\n\nThe two clubs reached an agreement at a meeting in London on Tuesday.\n\nHundreds of Juventus fans turned up at Milan's Malpensa airport to welcome the player.\n\nJuve announced his arrival with a picture of him alongside club president Andrea Agnelli holding up the number 10 jersey.\n\nTevez signed a five-year contract when he joined the Sky Blues in 2009 after previously playing for Manchester United.\n\nCity paid his advisors - who owned his contract - a reported £25.5m fee, although some have claimed the figure was £47m.\n\nHe has made 148 appearances for the club, scoring 74 goals, but the relationship with former manager Roberto Mancini soured in 2011 when he was fined and suspended following an incident in a Champions League match against Bayern Munich.\n\nCity must now search for a replacement but have said they will not pay the £53m asking price for Napoli forward Edinson Cavani."}