{"url": "https://www.bbc.com/sport/football/15572442", "title": "Euro 2012 play-off: Estonia 0-4 Republic of Ireland", "description": "The Republic of Ireland look assured of a place in the Euro 2012 finals as they win 4-0 away to Estonia in the play-off first leg.", "content": "The Republic of Ireland effectively sealed their place in the Euro 2012 finals thanks to a big win in Tallinn.\n\nIpswich midfielder Keith Andrews rose to head in a 13th-minute opener and then Estonian defender Andrei Stepanov was sent-off for a second yellow card.\n\nIreland took advantage in the second half with Jonathan Walters forcing in a header and Robbie Keane making it 3-0.\n\nEstonia were down to nine men when Raio Piiroja was dismissed before Keane got the fourth with a late penalty.\n\nThe skipper slotted in his 53rd goal for the Republic after substitute Stephen Hunt went down under Ats Purje's challenge.\n\nA carnival atmosphere can be expected in Dublin's Aviva Stadium on Tuesday when Giovanni Trapattoni's men will surely confirm their place in next summer's finals in Poland and Ukraine, an outcome that improves Trapattoni's chances of a new contract from the Football Association of Ireland (FAI).\n\nEstonia made an encouraging start with Konsantin Vassiljev's shot deflecting off Andrews and looping over the bar.\n\nHowever, the opening goal came at the other end as Keane supplied Aidan McGeady on the left and his chipped cross from the edge of the box set up Andrews to head in his third international goal.\n\nStoke City's Jonathan Walters, in for the suspended Kevin Doyle, sent a couple of efforts off target while Vassiljev had a worried keeper Shay Given diving for a shot from distance that looked only inches wide.\n\nStepanov's dismissal for a second yellow card came 11 minutes before the interval, and Hungarian referee Viktor Kassai could well have flashed a straight red as Keane looked to be the last man when the home defender clattered into him.\n\nThe Irish did not immediately go all out to try to kill off the contest, but they hammered home their advantage in the second half.\n\nWalters headed in from Keane's looping ball to the far post in the 67th minute after McGeady's free-kick had been parried by keeper Sergei Pareiko.\n\nKeane tapped a rebound into an empty net to make it 3-0 on 71 minutes.\n\nAn Andrews free-kick deceived Pareiko and, when he could merely flick out a foot to block the ball, LA Galaxy striker Keane pounced.\n\nPiiroja's night went from bad to worse 13 minutes from time when he was booked for a second time, this time for handball, joining fellow central defender Stepanov back in the changing rooms.\n\nKeane capped a memorable night with an 88th-minute penalty after Purje was adjudged to have impeded Hunt."}