{"url": "https://www.bbc.com/sport/scotland/15239371", "title": "Misfiring Fernando Torres given backing by Spain coach", "description": "Spain coach Vicente Del Bosque is poised to rotate his side against Scotland but insists he is pleased with struggling striker Fernando Torres.", "content": "Spain coach Vicente del Bosque has backed under-pressure striker Fernando Torres ahead of the final Euro 2012 Group I qualifier against Scotland.\n\nDel Bosque is poised to rotate his players having already topped the group then beaten Czech Republic on Friday.\n\n\"I saw Fernando in good form with a lot of energy and enthusiasm,\" said Spain's head coach.\n\n\"Unfortunately we didn't find the right pass for him against the Czechs, but I am happy with his performance.\"\n\nChelsea team-mate Juan Mata and Real Madrid midfielder Xabi Alonso scored the goals that eased Spain to victory against the Czechs.\n\nTorres, who has also been going through a lean spell with his English club, is looking to break an international scoring duck that stretches back more than a year but still has the support of his national coach.\n\n\"He did what I asked him,\" said Del Bosque. \"Fernando made them defend deep and opened up space.\"\n\nHowever, Athletic Bilbao striker Fernando Llorente, or Sevilla's Alvaro Negredo, could be in line to start ahead of Torres should Del Bosque decide to reshuffle his forward line.\n\nDel Bosque played a full-strength side in Prague, but Raul Albiol is missing through injury, while fellow defender Sergio Ramos and midfielder Xabi Alonso are doubtful after picking up knocks in that game.\n\nSo Valencia left-back Jordi Alba is in line to make his debut, while Thiago, Javi Martinez, Pedro and Santi Cazorla could all start.\n\n\"We have lots of players with quality and plenty of alternatives,\" Del Bosque said.\n\n\"Our players have been playing a lot of games and it is normal some have suffered tiredness.\n\n\"That is why rotating the team against Scotland is an option.\"\n\nSpain's 2-0 win, following by Scotland's single-goal victory in Liechtenstein, means the Czechs must gain more points than the Scots on the final evening to deny Craig Levein's side a place in the play-offs.\n\nHowever, despite the importance of the game for the teams seeking second spot, Del Bosque will rest Iker Casillas, despite the goalkeeper and captain being one match away from equalling Andoni Zubizarreta's record 126 caps.\n\nCasillas is believed to prefer celebrating the milestone during a Wembley friendly with England next month and that could mean a start for Jose Reina.\n\nLiverpool goalkeeper Reina stressed that the Spanish camp was determined to finish the qualifying group with maximum points.\n\n\"We have to try to win,\" he said.\n\n\"The Scots are fighting with the Czech Republic yet there is nothing we can do but play our best.\n\n\"The target is not to lose a single point in the group, so even a draw wouldn't be good for us.\""}