{"url": "https://www.bbc.com/sport/football/23923007", "title": "World Cup Group C: Republic of Ireland 1-2 Sweden", "description": "The Republic of Ireland's World Cup qualification hopes are left hanging by a thread after Sweden win in Dublin.", "content": "The Republic of Ireland's World Cup qualification hopes were left hanging by a thread after Sweden clinched a deserved comeback victory in Dublin.\n\nRobbie Keane poked in his 60th international goal in the 21st minute after a bright start from the hosts.\n\nBut Johan Elmander headed a brilliant equaliser 12 minutes later as the Swedes began to take control.\n\nAnd with Zlatan Ibrahimovic dictating play, veteran Anders Svensson stroked in the winner on 57 minutes.\n\nThe result means the Republic need to win in Austria on Tuesday and away to Germany next month to maintain any faint hopes of qualification, with a further home game against Kazakhstan to follow.\n\nFriday's result will inevitably lead to further criticism of Republic manager Giovanni Trapattoni and increase the prospects of him losing his job at the end of the current qualifying campaign.\n\nThe match kicked off with both sides knowing defeat would leave them with an uphill struggle to clinch a play-off place behind runaway group leaders Germany.\n\nThe Republic looked the more lively and purposeful outfit in the early stages, with Sweden centre-back Martin Olsson having to make a brave block to deny a goalbound Shane Long shot in the second minute.\n\nThe Swedish defence appeared vulnerable under the high ball with Glenn Whelan firing straight at keeper Andreas Isaksson in the eighth minute and Jonathan Walters then off target after a crunching challenge from John O'Shea on dangerman Ibrahimovic.\n\nAt the other end, Marc Wilson made up for misjudging the flight of a deep cross as he reacted brilliantly to block an angled Ibrahimovic shot in the 16th minute.\n\nHowever, the Republic were continuing to look the busier and gave the visitors a scare on 20 minutes as an attempted cross from James McClean bounced on Isaksson's crossbar.\n\nThe home team's enterprise was rewarded within a minute as Keane's chased down a weak Mikael Lustig back header and scrambled home after his initial poked shot hit the post.\n\nBut that was as good as it got for the Irish as they quickly surrendered the initiative.\n\nElmander had a chance to level within two minutes but scuffed his shot into David Forde's arms after hesitation in the Irish defence.\n\nOn the half-hour, the unmarked Sebastian Larsson missed a glorious chance to level as he somehow headed wide from six yards after a beautifully weighted cross from Ibrahimovic.\n\nBut the equaliser did come three minutes later as Lustig's brilliant right-wing cross was glanced home by Elmander after the Norwich striker got in ahead of Richard Dunne.\n\nMcClean tested Isaksson six minutes into the second half but the Swedes, with Ibrahimovic controlling the game, were looking the more threatening.\n\nForde had to race from his line on 55 minutes to dive at Larsson's feet after Ibrahimovic split the Irish defence with another superb pass.\n\nBut Forde's efforts were to count for little when, seconds later, Ibrahimovic passed for 37-year-old Svensson to run through and fire past the keeper on the night he won his national-record equalling 143rd cap.\n\nIn the closing stages, their was little shape to the Republic team, with recent Everton signing James McCarthy struggling to make any impression on the contest.\n\nTrapattoni opted not to send on the creative talents of Wes Hoolahan in the closing stages instead opting to give an international debut to the midfielder's Norwich club-mate Anthony Pilkington while Simon Cox was also introduced to little effect.\n\nLong did managed to find a couple of promising positions but was unable to pick out an attacking colleague as the visitors ran out victorious.\n\nGermany's 3-0 win over Austria kept the Group C leaders five points ahead of the Swedes, with the Republic fourth in the table, level on points with the Austrians."}