{"url": "https://www.bbc.com/sport/football/24439813", "title": "Scotland 2-0 Croatia", "description": "Scotland end a disappointing World Cup qualifying campaign with an excellent home win over Croatia at Hampden Park.", "content": "Scotland ended another unsuccessful qualification campaign with a tremendous victory over Croatia.\n\nRobert Snodgrass, who became a father at the end of last week, celebrated in style with a headed opener, to add to his winner in Zagreb in June.\n\nThe tireless Steven Naismith grabbed the second on his 25th international appearance, following up as Barry Bannan's penalty was saved.\n\nScotland's first home win in Group A lifts them above Wales, into fourth.\n\nThe performance, above all, leaves Scotland with good reason for optimism as far as Euro 2016 qualification is concerned.\n\nThey have recorded three wins since Gordon Strachan took over from Craig Levein - two against Croatia and one in Macedonia.\n\nBut supporters leaving Hampden on Tuesday night may wonder what might have been had Strachan been in place from the beginning.\n\nThe Scots' opening goal was a delicious blend of graft and craft - in many ways typifying Strachan's Scotland.\n\nCharlie Mulgrew did brilliantly to win possession on the half-way line before setting Naismith haring down the left.\n\nMulgrew continued his run, picked up on Naismith's perfectly-weighted return pass to send a high, hanging cross to the back post where Snodgrass showed greater desire than Dejan Lovren to head down past Stipe Pletikosa.\n\nScotland's half-time lead could have been greater, but for a fingertip save by Pletikosa from another Snodgrass effort minutes later.\n\nIt was the culmination of a wonderful, flowing move involving Mulgrew, James Morrison and Scott Brown as the Scots' confidence flourished.\n\nScotland continued to cope fairly comfortably as Croatia probed for an equaliser, with a counter-attacking game suiting the home side.\n\nBut with the game still very much in the balance, Scotland were awarded a penalty as Ikechi Anya tumbled under the challenge of Domagoj Vida.\n\nAnd though Pletikosa saved superbly from Bannan's spot kick, Naismith reacted quickest to slot the rebound past the despairing keeper.\n\nFor all of Croatia's ability on the ball, they failed to make Allan McGregor work to any great degree.\n\nThere was a moment of panic when substitute Eduardo rounded the Hull City goalkeeper, having escaped the attentions of Grant Hanley, but he was forced wide and managed only to shoot into the side-netting.\n\nMcGregor was similarly untroubled in the first half, with Mario Mandzukic passing up the visitors' best opportunities.\n\nHe looked likely to score when he took advantage of a breakdown in communication between Hanley and Mulgrew, only for Anya to make a crucial intervention as Mandzukic prepared to shoot.\n\nAnd when he did manage a shot at goal shortly afterwards, his volley bounced into the ground and up over the bar.\n\nThe Croatians flattered to deceive at times and if they are to reach the World Cup via the play-offs, their performance will have to significantly improve.\n\nAs for the Scots, they will be waiting impatiently for the next qualifying campaign to begin."}