{"url": "https://www.bbc.com/sport/football/17985556", "title": "Alex McLeish expects to stay at Aston Villa next season", "description": "Aston Villa manager Alex McLeish expects to be in charge next season, despite calls for his departure from fans.", "content": "Aston Villa boss Alex McLeish expects to still be in charge next season, despite calls for his departure from what appears the majority of home fans.\n\nHaving left Birmingham City to join Villa, the ex-Rangers and Scotland boss's appointment last summer was not well received at the time.\n\nVilla fans have since become even more disenchanted with the 53-year-old Scot.\n\nBut McLeish told BBC Sport: \"I'd expect to be here next season and hope to win over the dissenting Villa fans.\"\n\nVilla only picked up the point that effectively sealed their Premier League safety on Sunday, thanks to a 1-1 draw at home to 10-man Champions League hopefuls Tottenham Hotspur, while neighbours West Bromwich Albion did them a favour by coming from two goals down to draw at Bolton.\n\n\"It seems to me there is a real difference in opinion between what Alex McLeish feels will happen and what the fans want to happen in the next few weeks. He was very bullish in Sunday's post-match interview on BBC WM, surprisingly so, but he clearly is planning on being there on day one of next season. The question remains, does Randy Lerner share that view? Time will tell, but at the moment what the fans are calling for and what Alex McLeish wants are two totally different things.\"\n\nChairman Randy Lerner was not present at Villa Park but McLeish said: \"I think Randy will be pretty pleased with the outcome.\n\n\"He's been very supportive in texts over the last few days, which indicates great support for me.\n\n\"It's been a tough season, as tough as I've had.\n\n\"I knew the challenge I was taking on. But going through it is always different from what people tell you. You have to experience it.\n\n\"I'd like to think I've showed my leadership and always stood up in the face of adversity all season. I am proud to be intact and not having thrown myself off a bridge or something.\"\n\nMcLeish has also received backing from within the dressing room, from veteran striker Emile Heskey, who was asked whether he thought McLeish would still be at Villa next season.\n\n\"I don't see why not,\" Heskey told BBC Sport. \"We are more or less safe now so he will be looking forward to next year.\n\n\"He is a battler, he will battle on and I am sure he will again.\"\n\nBut, judged by the thousands of 'McLeish Out' leaflets being handed out outside the ground on Sunday and the chants from all four sides of the ground at the final whistle of \"Sack McLeish, My Lord\" (to the tune of Kumbayah), whether the Villa fans are still in tune with him is quite another matter.\n\nThe fact that McLeish used to manage Blues is understood to be a side-issue compared with the team's perceived lack of entertaining football.\n\nThey have won just four matches at Villa Park to ensure their worst home record of their 138-year history, as well as their lowest points total in the Premier League.\n\nBut McLeish argues that, having lost Ashley Young and Stewart Downing last summer, and his campaign wrecked by the loss of top scorer Darren Bent at the end of February, and skipper Stilyan Petrov at the end of March, he has only been able to play with the cards he has been dealt.\n\n\"I think the Villa fans in general have been excellent,\" said McLeish. \"I met some nice people at the end-of-season dinner the other night.\n\n\"I felt the guys I met were genuine. They knew what I was working with.\n\n\"This season we have taken the plunge into the reduction of wages. It's hopefully helped the finances a little bit.\n\n\"I bought into a project with Randy Lerner and the board and Aston Villa that I would work with the club to try and reduce the wages.\n\n\"There might be some pain along the way with that and sure enough, that has come to the fore.\n\n\"Certainly when I assessed the squad at the start I thought there was a possibility of being in the lower half of the table.\n\n\"Despite the name Aston Villa FC, it comes down to depth, strength of squad and quality. I thought we might have problems of our own if we got injuries.\n\n\"I knew we had a young back-up squad. Many of the young lads weren't really ready to be plunged in but hopefully it will stand them in good stead in terms of fighting to get in the squad next season.\n\n\"The young lads coped great and showed a lot of bottle and said 'let me in that team.' That's what we want. I am not looking for players who can't handle the pressure.\n\n\"We need players here who can go in front of the crowd and express themselves.\""}