{"url": "https://www.bbc.com/sport/football/14797327", "title": "Manchester City to probe 'offensive email from Garry Cook'", "description": "Manchester City are to investigate claims chief executive Garry Cook sent an email to defender Nedum Onuoha's cancer-suffering mother mocking her illness.", "content": "Manchester City are to investigate claims chief executive Garry Cook emailed defender Nedum Onuoha's cancer-suffering mother mocking her illness.\n\nDr Anthonia Onuoha received an offensive email which was intended for the club's football administrator Brian Marwood, in regard to a contract dispute her son was having with City.\n\nCook has denied he sent the message, claiming his account was hacked.\n\nDr Onuoha told the Sun the email had left her \"humiliated and devastated\".\n\nDefender Onuoha's mother, who acts as his agent, had previously sent a message to Marwood and Cook, explaining that while she was \"ravaged with cancer\" it would not prevent her negotiating on behalf of her son.\n\nDr Onuoha then received an email, allegedly from Cook and addressed \"Brian\", which apparently ridiculed her use of language in describing her illness.\n\nThe email is reported to have read: \"Ravaged with it!!...I don't know how you sleep at night. You used to be such a nice man when I worked with you at Nike. G\".\n\nManchester City have responded to the allegations by releasing a statement promising a full investigation.\n\n\"Following allegations made to the football club by Dr Anthonia Onuoha, subsequently reported in today's [Monday] media, the club can confirm that a board-led review has been launched into the matter,\" said the statement.\n\nDr Onuoha told the Sun: \"When I opened my emails and saw the message, it was the worst day of my life, even worse than being diagnosed with cancer.\n\n\"I couldn't understand how anybody could behave like that. I just cried and cried for hours. I'm critically ill and at that point I was undergoing chemotherapy.\n\n\"I was just so shocked but I couldn't tell Nedum or any of my family because I didn't know how they would react.\"\n\nDr Onuoha said she replied to Cook the following day, writing: \"Thanks very much for your insightful email.\"\n\nShe told the Sun: \"The illness I have is very stressful, I'm having chemotherapy and radiotherapy, including having radiotherapy on my brain and this year has been traumatic. I didn't want anybody adding to my stress but that is what they've done.\n\n\"The feeling of humiliation still persists. Now I just want the FA and the Premier League to see what's happened and to take the appropriate action. Treating people like this is completely abominable.\"\n\nCook apologised for \"any hurt or embarrassment this may have caused\" as well as denying sending the email.\n\nHe told Dr Onuoha: \"I cannot and will not condone this unacceptable behaviour. I can confirm Brian did not receive this email and disciplinary action is currently under way regarding one of our employees.\""}