{"url": "https://www.bbc.com/sport/football/22446853", "title": "Sir Alex Ferguson will retire as one of the managerial greats", "description": "Chief football writer Phil McNulty believes that Sir Alex Ferguson has changed British football for ever", "content": "Manchester United's landscape - and that of British football - changed forever just after 9am on Wednesday, 8 May 2013.\n\nThis was when the domestic game's towering figure called time on the successes, trials and tribulations of 26 years at Old Trafford. Sir Alexander Chapman Ferguson announced his retirement.\n\nThe 71-year-old Scot, with a stand bearing his name and a statue on the concourse outside, will take charge of his final game at the self-styled Theatre of Dreams when United face Swansea City on Sunday.\n\nIt was an announcement that came as a seismic shock to football's system, coming so soon after a series of bullish statements from Ferguson hinting at exactly the opposite of walking away.\n\nHow swiftly the scenery has been moved at Old Trafford. It was only in March, as Ferguson prepared to face Real Madrid in the Champions League, that he wrote these words in his programme notes:\n\n\"This is what it is all about - a packed Old Trafford, the floodlights on, the pitch glistening and two of the greatest and most romantic clubs in the game about to do battle.\n\n\"People ask me why I don't retire after so many years in the game, but how could anyone with an ounce of passion for football in their soul voluntarily walk away from the opportunity to be involved in this kind of occasion?\"\n\nAnd yet he has.\n\nAfter winning 13 Premier League titles, two Champions Leagues, two domestic league and FA Cup doubles and a career spent building a monument to success at a stadium that grew in size in line with the successes he fashioned, Ferguson will take his leave.\n\nFrom the now demolished Manor Ground in Oxford on 8 November 1986 to The Hawthorns and West Bromwich Albion on Sunday, 19 May 2013, Ferguson has cast a giant shadow over all he surveyed.\n\nFrom the early years of struggle, which ended with the 1990 FA Cup win against Crystal Palace in a Wembley replay, through all the glories at home and abroad, Ferguson concludes his time at Old Trafford as a uniquely enduring personality. Given the quick fix demands and impatience of the modern Premier League era, his like will never been seen again.\n\nFollowing his aborted first retirement in 2002, there was never going to be the uncertainty of a long goodbye but the speed with which whispers about his retirement turned to a scream painted a picture of a stunning series of events.\n\nAt the weekend it was announced Ferguson would require hip surgery in the summer, prompting a rush of bets at the bookmakers in support of Everton manager David Moyes as his successor.\n\nFinally, definitively, the rumours on the golf course at Dunham Massey in Greater Manchester on Tuesday - scene of a United players versus coaches game - led to the official announcement.\n\nSay what you like about Ferguson, and plenty will, but no-one can question his stellar contribution to football and British sporting life.\n\nCharismatic, explosive, contrary. Love him or hate him, football in general and Manchester United in particular will be poorer for his departure.\n\nHe was a character of rare contrasts. Members of the media who were often on the wrong end of his rages also found themselves receiving his kindness and support in troubled times.\n\nHis former assistant with Scotland, and briefly at Old Trafford, Walter Smith, once told me: \"He is so well read, interesting and great company.\n\n\"If you asked me the old question about who you would have at your ideal dinner party, Sir Alex would be at mine.\"\n\nFor all the talk of the \"hairdryer\" and the fiery temper that could see players, officials and the media verbally demolished, Ferguson was never a managerial dinosaur sticking to old values and principles.\n\nFerguson, and this was one of his greatest skills, moved with football's times. Whereas it would be hard to imagine Brian Clough or Bill Shankly coping with some of today's more money-driven quirks, Ferguson adapted in his management techniques and tactically.\n\nHe was devout in his pursuit of attacking football and trust in young players. The history and tradition of Manchester United ran red through his veins.\n\nFerguson was a moderniser but one principle never changed. He ruled, and anyone who challenged that rule was moved on. It applied to the greatest as strictly as anyone else, with Roy Keane, David Beckham, Jaap Stam and Ruud van Nistelrooy the prime exhibits.\n\nBut to suggest Ferguson simply ruled by iron fist is to do him a grave disservice. How could his United teams play with such freedom and flair if they lived in fear of their manager?\n\nPlayers spoke of his gift for man-management, his ability to say the right things at the right time. In short, he is a man who deserves his place among the true greats - and even those who support fierce rivals such as Liverpool cannot seriously argue with that.\n\nPerhaps there were signs that he was getting ready to say goodbye but few detected them. Assistant Mike Phelan admitted Ferguson was \"too distraught\" to face the media after this season's Champions League defeat to Real Madrid in March, believing Turkish referee Cuneyt Cakir's decision to send off Nani with United ahead robbed them of victory.\n\nThe pain was obvious, particularly as Ferguson has always believed United could have achieved more than the two Champions League wins he brought. Did he believe his last great chance, and the opportunity to win the tournament at Wembley as Sir Matt Busby's United did against Benfica in 1968, had gone?\n\nIf this was a low, surely the highest high was the night in Barcelona's Nou Camp in May 1999 when stoppage-time goals from Teddy Sheringham and Ole Gunnar Solskjaer turned defeat into victory and had Ferguson uttering his now famous phrase: \"Football - bloody hell.\"\n\nFerguson has even added to football's own lexicon with phrases such as \"Fergie Time\" coined to describe those extra minutes many felt he was awarded simply by force of character that allowed United to win so many games.\n\nOne phrase sums up Ferguson more than any other - winner. And now United must find a man to cope with the pressure of succession.\n\nUnited infamously botched the next move after Busby retired in the late '60s. Ferguson will remain in the boardroom but his influence must surely be limited.\n\nMoyes, so strongly supported and admired by Ferguson, is the heavily-backed favourite but has no serious European pedigree or record of success in 11 years at Goodison Park. There are others who suggest Moyes's work at Everton has set the platform for the sort of opportunity Old Trafford would afford him.\n\nJose Mourinho is expected to be available shortly when he leaves Real Madrid, but Chelsea is his expected destination and senior figures inside Old Trafford are known to have reservations about his style and also his tendency to be a short-stay coach.\n\nAn outsider could be Borussia Dortmund's Jurgen Klopp, whose masterly guidance has taken them to an all-Bundesliga Champions League final against Bayern Munich. He is a progressive coach and looks to have the confidence and personality to cope with Old Trafford's unique demands.\n\nAnd what of promotion from within? Ryan Giggs is coming towards the end of his Old Trafford playing career but it would be a gamble of epic proportions to entrust the task of succeeding Ferguson to a managerial novice.\n\nWhatever the next twist in this drama, one thing is certain. Sir Alex Ferguson's power, influence and personality means football in this country will never be the same again."}