{"url": "https://www.bbc.com/sport/football/23476535", "title": "Burkina Faso youngster Traore impressing for Chelsea", "description": "Burkina Faso youngster Bertrand Traore is making an impression on Chelsea's pre-season tour of Asia.", "content": "Burkina Faso youngster Bertrand Traore has made an impression for Chelsea on their pre-season tour of Asia.\n\nBecause of regulations he is not yet a Chelsea player and they can only sign him on 6 September, his 18th birthday.\n\nThis week he has scored in a 4-1 win over a Malaysia XI and added a spectacular goal in an 8-1 thrashing of the Indonesia All Stars.\n\nWhy is Traore not a Chelsea player? Football sides are not allowed to sign any foreign players under the age of 18 unless both team and player are from an EU country (or are less than 100km apart across an international border) or the player's parents move to that country for non-football reasons\n\n\"He's a young lad, but I'm sure he's got a bright future at Chelsea,\" team-mate Gary Cahill said.\n\nTraore was part of the Burkina Faso squad at the 2012 Africa Cup of Nations in Equatorial Guinea and Gabon - coming on as a substitute in their 2-1 loss to Sudan in a group game.\n\nCahill says that Traore is coping well with playing and training alongside the first team regulars.\n\n\"It's too early to say he's ready to do this and that, and we don't want to get carried away.\n\n\"But he's certainly not looked out of place in training alongside some top international players.\"\n\nTraore was not called up by coach Paul Put for the Nations Cup in South Africa earlier this year, where the Stallions were runners-up to Nigeria.\n\nBut he has been included in Put's recent squads for the 2014 World Cup qualifiers with Burkina Faso still in with a chance of reaching the final round of play-offs.\n\nIn January 2011, Traore told the BBC's African sports programme Fast Track: \"I want to play in the first team for Chelsea, I want to play the European Champions League with the big names.\n\n\"I want to play every match for Chelsea and in the future I want to become the best player in Africa and maybe Europe also.\""}