{"url": "https://www.bbc.com/sport/football/21998112", "title": "Neil Warnock 'parts company' with Leeds United", "description": "Leeds manager Neil Warnock parts company with the Championship club after their 2-1 home defeat by Derby.", "content": "Leeds manager Neil Warnock has parted company with the Championship club.\n\nWarnock left about two hours after Monday's 2-1 defeat by Derby, a loss that left Leeds well adrift of the play-offs and just five points clear of the relegation zone.\n\nUnited, who have lost three successive matches, have six league games left.\n\n\"We need to look to the future and the search for his replacement is under way,\" said Leeds chief executive Shaun Harvey.\n\n\"There is no fixed timescale as securing the services of the right person is the primary objective to give us the best chance of promotion next season.\"\n\nWarnock spent 14 months at Elland Road after replacing Simon Grayson in February 2012.\n\nHis assistants, Mick Jones and Ronnie Jepson, have also left the club.\n\nLeeds academy manager Neil Redfearn will take charge until Warnock's successor is appointed.\n\n\"We would like to thank Neil for his efforts during his time as our manager and share his disappointment that we could not achieve promotion,\" added Harvey.\n\n\"We would also like to thank Mick Jones and Ronnie Jepson, who will leave the club with Neil, for all their hard work.\"\n\nWarnock, 64, had previously admitted he would leave the West Yorkshire side if they failed to win promotion to the Premier League.\n\nThe former Sheffield United and QPR manager also indicated he could leave before his contract expires in the summer, once it was mathematically impossible for the Whites to clinch a return to the top flight for the first time since 2004.\n\nLast month, he held talks with Leeds owners GFH Capital, a Dubai-based equity group which bought the club from Ken Bates in December, about possible successors.\n\n\"I don't think they should rush into a permanent appointment because there are no outstanding candidates at the moment, but there will be in the summer,\" said Warnock in his post-match media conference following the defeat by Derby.\n\n\"I have been a manager for 33 years and these last 12 months have been the hardest. I have given it my best shot, but, being honest, we haven't been good enough in the final third of the pitch.\""}