{"url": "https://www.bbc.com/sport/football/20278425", "title": "Reading 2-1 Everton", "description": "An Adam Le Fondre double earns struggling Reading their first Premier League victory of the season in a 2-1 win over Everton.", "content": "Adam Le Fondre earned struggling Reading their first Premier League win of the season with both goals in a battling comeback victory over Everton.\n\nThe visitors dominated the first half, Steven Naismith stabbing his side ahead, before Phil Jagielka's header was cleared off the line.\n\nBut Reading stormed back with Le Fondre equalising through a glancing header from Nicky Shorey's free-kick.\n\nLe Fondre won it with a late penalty after being fouled by Seamus Coleman.\n\nAt the end of an absorbing contest there were scenes of both joy and relief at the Madejski Stadium, with Reading's Russian owner Anton Zingarevich punching the air in delight.\n\nThe Royals' first top-flight victory since May 2008 was richly deserved, and came against an Everton side which had lost only one of their last 20 league games.\n\nBut the Toffees, who had more than half of their team playing in midweek internationals, simply ran out of steam.\n\nDespite their flying start to the season, which had taken them to fourth in the table, David Moyes's men had fallen behind in their previous six league games.\n\nYet they started brightly in Berkshire as Phil Jagielka, stand-in captain after Phil Neville underwent a knee operation, was denied by keeper Adam Federici following a corner by Thomas Hitzlsperger, making his first league start since joining the club last month.\n\n\"This is just what Reading required to kick-start their season. They may have rode their luck but the Royals showed the Premier League they are not short of belief as they came from behind to beat an Everton side that started the day fourth in the table.\"\n\nNikica Jelavic then wasted another chance, volleying into the ground from close range, before Everton took the lead in the 10th minute.\n\nHaving kept their first Premier League clean sheet of the season in the previous game at Norwich, Reading's defence was guilty of a comedy of errors which allowed Jelavic and Marouane Fellaini to combine for Naismith to stab home from close range.\n\nEverton should have gone on to secure all three points before half-time.\n\nSteven Pienaar went close to doubling the lead after a mistake by Chris Gunter, before the busy Hitzlsperger stung the fingertips of Federici, who then did well to keep out new England cap Leon Osman.\n\nApart from one moment when Tim Howard was beaten to a long punt forward by Le Fondre, Everton were largely untroubled before the break.\n\nMoyes's side were denied a penalty when Sean Morrison appeared to handle Jelavic's goalbound shot before Jay Tabb cleared off the line from Jagielka on the stroke of half-time.\n\nBut Everton, who blew a lead in their previous away game, did so again when they allowed Le Fondre to head past Howard following Shorey's curling 51st minute free-kick.\n\nAnd, after being needlessly bundled over by Coleman with 11 minutes remaining, Le Fondre picked himself up to send Howard the wrong way from the spot."}