{"url": "https://www.bbc.com/news/uk-wales-politics-43905683", "title": "Now not time for leader bid - Morgan", "description": "Eluned Morgan calls for debate before further nominations for the Welsh Labour leadership contest.", "content": "Welsh Language Minister Eluned Morgan has said \"now is not the right time\" to announce a bid for this autumn's Welsh Labour leadership contest.\n\nMs Morgan said she wanted a \"thorough debate\" on the \"biggest issues confronting us today\" before further candidates were nominated.\n\nWith Mark Drakeford the only one declared so far, there was speculation she would join the race on Friday.\n\nSenior Labour figures said they doubted she had enough support from AMs to run.\n\nIt follows calls for a woman to be on the ballot paper to succeed Carwyn Jones, who is stepping down as Welsh Labour leader and first minister later this year.\n\nMs Morgan was speaking at a money advice event in Pembroke Dock on Friday.\n\nShe said: \"Now is not the right time to put my name forward because I am very keen that we have a thorough debate within the party on the biggest issues confronting us today.\"\n\nThose issues included \"huge poverty rates in Wales\", housing, climate change and an ageing population.\n\nMs Morgan announced she had set up a \"Beyond the Bubble\" website, \"where I'm asking people to let me know what they think the future of Wales should look like\".\n\nShe wanted to ensure \"before I decide whether or not to throw my hat into the ring, that I am clear about what I would like to achieve for my country\".\n\n\"That I am clear about the vision that I would have to offer,\" she said.\n\nThe Mid and West Wales AM added: \"I have not asked any AMs to nominate me for the leadership so far, but I have kindly requested them to refrain from nominating further candidates so that we can make time for this debate.\"\n\nMs Morgan said she \"understood\" there would be pressure for a woman to stand in the election, but she was not interested in \"simply making up the numbers\".\n\nA number of Labour politicians have said they want a diverse range of contenders, including a female candidate, and warned against a \"coronation\" of a single candidate without a contest.\n\nBBC Wales also understands the Economy and Transport Secretary Ken Skates, AM for Clwyd South, is under intense pressure to run to ensure a politician from north Wales stands.\n\nCandidates need support from five other Labour AMs to be on the ballot paper. Mr Drakeford is backed by eight AMs - more than enough to run.\n\nWelsh language society Cymdeithas yr Iaith criticised Ms Morgan for not publishing her website in Welsh, saying it was a \"disgrace\" as she is the Welsh Language minister.\n\nThe website was later amended and is now available in both English and Welsh."}