{"url": "https://www.bbc.com/news/election-2017-40006721", "title": "Labour activist's Tinder vote drive", "description": "A Labour supporter turns to the dating app to encourage people to register to vote.", "content": "A Labour activist is using dating app Tinder to encourage people to register to vote in the general election ahead of the midnight deadline.\n\nEligible voters have until 23:59 BST to register online through the official website for the 8 June election.\n\nAfter matching with potential dates on the app, she has been sending them links to the registration site.\n\n\"A couple of people have been disappointed, but more have found it fun,\" said Yara Rodrigues Fowler, 24.\n\nTinder users upload some pictures of themselves to the app and add a short biography.\n\nThey then browse through other people's profiles, and can either swipe left or right.\n\nIf both parties swipe right, indicating mutual approval, a chat window opens up and the two can start chatting.\n\nLondon-based Rodrigues Fowler has been matching with both men and women on the app to encourage them to vote.\n\nShe said: \"Some have asked me how they should vote, and one has even asked me to be his proxy.\n\n\"Another didn't know whether his constituency was a marginal, so he sent me his postcode and I found out for him.\"\n\nMore than two million people have joined the register in the month since Prime Minister Theresa May revealed she was calling a snap election.\n\n\"I've been thinking a lot about how to reach young people and get them to register to vote. I was thinking, what notifications do people pay most attention to?,\" said Rodrigues Fowler.\n\n\"I get lots of matches with people (especially men) who I don't find attractive and are sometimes pretty gross, so I thought I'd put that energy to good use.\"\n\nRodrigues Fowler - a Labour voter - says not everyone on Tinder agrees with her politically, although it is hard to be sure of a stranger's tone on a dating app.\n\n\"I spoke to one man who said he was a Tory but I think he was just being provocative in a misguided attempt to flirt,\" she said.\n\nThe latest official figures published in March show that 45.7 million people were registered to vote in a general election as of 1 December 2016.\n\nThe Electoral Commission has warned that about seven million people across Britain who are eligible to vote are not registered.\n\nBefore the EU referendum last May, the Times reported that David Cameron was using Tinder to encourage people to back a Remain vote.\n\nHowever, 10 Downing Street spokesperson told the BBC Mr Cameron \"was holding meetings with various social media outlets to explore ways of encouraging more people to vote\" - but was not on Tinder."}