{"url": "https://www.bbc.com/sport/football/27253266", "title": "Crystal Palace: How Tony Pulis achieved Premier League survival", "description": "How Tony Pulis led Crystal Palace from Premier League relegation-certainties to mid-table comfort in record-breaking fashion", "content": "We agree to meet Tony Pulis at the Crystal Palace training ground at 7am, though the 56-year-old warns he may allow himself a lie-in. Having recently defied the odds to ensure the club will be playing Premier League football again next season, who could blame him?\n\nKeen to be there when he arrives, we contact Pulis at 6am to check on his progress. \"Already here, in the gym!\" the Welshman replies.\n\nWhen we get to Beckenham, there he is - kitted out in exercise gear, beads of sweat on his brow and dumbbells lofted to the sky.\n\nSomehow, this illuminating little scene neatly encapsulates the man, his mentality and the work ethic that has underpinned a remarkable, record-breaking transformation at Selhurst Park.\n\nNo side bottom of the Premier League at the end of November has previously risen higher than 17th by the end of the season. Palace made sure of their survival with three games left when a club record-equalling fifth straight top-flight win, against West Ham, took them up to 11th.\n\nIt is all a far cry from five months ago, when four points from their opening 11 games - leaving them six points from safety - appeared to ensure this campaign would go the same way as the Eagles' four previous Premier League seasons and end in immediate relegation.\n\nA weary Ian Holloway had left his position as manager by mutual consent and Keith Millen was in temporary charge throughout a prolonged and complicated search for a new boss. More than four weeks passed before Pulis was appointed, yet there remained a sense of uncertainty about his suitability among fans, executives and even the man himself.\n\nOn Friday he was named Barclays Manager of the Month for April, and is a leading contender to be crowned manager of the year. Since he took charge, only Chelsea have a better defensive record, and Palace would be eighth in a recalculated table over that time.\n\nWith 16 new signings and only three points from eight games - six goals scored, 17 conceded - Holloway departed with an admission that Palace \"changed too much too quickly\", while he and chairman Steve Parish accepted a new, expansive game-plan had backfired.\n\nMillen steadied the ship with a draw against Everton and victory at Hull, watched from the stands by the incoming manager. After seven years as Stoke boss and having never been relegated in a 21-year managerial career, Pulis admits he \"was definitely taking a chance with that record\".\n\n\"I was very sceptical. Nearly everyone I spoke to said it's almost an impossible job,\" he tells BBC Sport. \"My biggest concern was we were six weeks and a lot of games from the transfer window to change things.\n\n\"But Sir Alex Ferguson and my ex-chairman Peter Coates thought it was a job that could be done because of the club, because everybody had written it off, because of the fantastic supporters.\n\n\"Steve [Parish] came down to my house in Bournemouth and we had a real good chat about things. I made the decision that I'd give everything I had to keep them up.\"\n\nIf Pulis was cautious about Palace, it is fair to say the feeling was mutual. \"I had some reservations,\" Parish recalls. \"There was a stereotype around Tony that he played the game a certain way and I frankly wasn't sure we had the players for us to play that way.\n\n\"This was November, there was no opportunity to get any players in, so I had to spend quite a bit of time with Tony. We talked about what great Palace sides were, how they played, the make-up of the area, the community spirit, everything about the club. We found a way forward.\n\n\"I believed we could stay up. Crucially, we weren't cut adrift. Other sides had fared pretty poorly. At a shareholders' meeting before I appointed Tony we went round and I said, 'I'm confident we can get out of it'.\"\n\nPulis finishes his morning work-out before showering and joining chief executive Phil Alexander and members of the coaching staff - Millen, Ben Garner, Dave Kemp and George Wood - for breakfast. After discussing ideas with Alexander for upgrades to the training ground, Pulis leaves to prepare for the session as his players roll in, get changed, see the physiotherapists and have a bite themselves.\n\nThe former Bournemouth, Gillingham, Bristol City, Portsmouth and Plymouth manager holds his weekly news conference - he does it standing up - and then training begins around 11am.\n\nThe facilities are certainly a throwback: a more tightly-packed car park you will struggle to find; a no-frills main building comprising changing rooms, a canteen, classroom and media area that doubles as a yoga space; a handful of offices situated in a fixed portacabin; a basic, makeshift gymnasium; and a field in good, but not pristine, condition featuring a few pitches and an uncovered all-weather area.\n\nBut despite all this, the atmosphere could hardly be more vibrant, relaxed, down-to-earth and welcoming, the feeling of positivity infectious whether you are part of the set-up or merely a visitor.\n\n\"Tony just brought such enthusiasm to the place,\" says assistant kit manager Danny Young. \"His work ethic is completely out of this world. We're all in at the crack of dawn because he's here to go to the gym. That sort of enthusiasm rubs off on the rest of us.\n\n\"I started here a week before Tony and you could feel a little bit of tension because results hadn't been brilliant. But there was a massive difference from day one and it gave us an extra lift. It's been a great few months and now the place is buzzing.\"\n\nThe squad set foot on the grass with a spring in their step. Tom Ince and Joe Ledley have barely finished tying their boot laces by the time they are engrossed in a one-touch passing challenge, excitedly trying to force an error. Neither buckle under the pressure.\n\nThis appears to be a happy and humble group; no unnecessarily loud or overbearing characters but the usual dose of banter and plenty of leadership, experience and professionalism.\n\n\"It was not easy turning people who have been told they're not good enough to compete and getting a team that believes they can win games,\" Pulis explains. \"A manager today is not just a coach, he's a psychologist, he's everything rolled into one. You do have to convince the players that they are good enough because there are so many knockbacks at this level and they have to keep bouncing back.\n\n\"They have to be strong mentally, as well as physically, and they have to feel as though you know what you're doing and they buy into it. They've got to have that feeling that you're leading them the right way. I think they've done that and brought into it unbelievably well.\"\n\nInce, a loan signing from Blackpool in January, adds: \"The lads were down, but the gaffer has just given everyone belief. For any club in this situation, trying to keep a team in the top flight, Tony Pulis is the man. \"The lads had the belief in each other to go out there every Saturday, lay our lives on the line and make sure we got to safety.\"\n\nJulian Speroni and Wayne Hennessey separate from the main group to work with goalkeeping coach George Wood as Scott Guyett, head of sports science and strength and conditioning, leads the warm up and Millen oversees a short, sharp footwork drill.\n\nPulis and the rest of his lieutenants, including ex-QPR and Tottenham boss Gerry Francis, assemble a short distance away and after Kemp picks teams for a set of dribbling and running races, two high-intensity small-sided games take place using confined pitches and mini goals.\n\n\"In the first month I was here we moved something like 15 players out of the club,\" says Pulis. \"We had to do a lot of work outside the starting XI and then we gradually nailed down a group.\n\n\"We looked at what qualities we had and struck on a system. There were lots of meetings about what we were trying to do, but the most important thing was ironing everything out on the training ground so everybody knew their role. Wherever the ball is they know where they should be, they have to be there and if they're not there it will cause problems.\n\n\"Then it's down to the players - whether they're prepared to work as hard as you want, whether they're prepared to do what you want them to do. The reason why we've achieved what we have is because everybody has done what we wanted them to do to the best of their ability.\n\n\"If anybody marches away from that and starts doing what they think is right for them, and not right for the team, then the team will collapse and be similar to what it was before I took over.\"\n\nWhether it is longer servants such as Damien Delaney, Mile Jedinak and Yannick Bolasie, summer signings like Adrian Mariappa, Jason Puncheon and Cameron Jerome, mid-season arrivals Scott Dann, Ledley and Ince, or fringe players such as Jerome Thomas, Barry Bannan and Glenn Murray, everyone shows maximum application and concentration.\n\nPulis soon takes sole command as the planned team run through full-speed attacking and defensive scenarios against youth-team players to finesse the formation, shape, organisation and tactics. They finish by practising set-plays with meticulous attention to detail.\n\nIn moving away from an approach under Holloway that was ambitious but left his team exposed, it is perhaps not surprising that Palace's passing and dribbling statistics have deteriorated under Pulis.\n\nHowever, their goalscoring and defensive numbers have improved and this has translated to a 46% winning record and an average of 1.5 points per game under Pulis (12.5% and 0.3 under Holloway).\n\n\"The team was very open, leaking goals and looking as though they would leak more,\" says Pulis, whose team has kept 10 clean sheets in 24 games compared to two in 12 before his arrival.\n\n\"The players were in bad positions. When we were in possession, even when we weren't, the team shape was not good. For what suited the players, it was far too stretched and at the wrong times.\n\n\"We wanted to be more solid but play quickly on the counter-attack, so you need pace up front. We have that in Jerome, Bolasie and Puncheon, but also Marouane Chamakh in a withdrawn striker role helped us stay a lot tighter. It's the first time Chamakh has operated in that number 10 role, but he's played it as well as anyone I've seen.\n\n\"We tightened up on everything and still I think we play good football. When we get the ball we want to play quickly through the pitch, small passes through the lines as quick as we can.\"\n\nAlthough his goals-per-game average and goals-to-shots ratio are worse this season than any of his five in the Premier League with Stoke, Pulis can argue that Palace's statistics for shots on target, completed passes in the final third and goals conceded are all superior.\n\nHis percentage of long passes this season is higher than last season but lower than the previous four.\n\n\"I think the perception of me has now changed, without a question,\" Pulis insists. \"It was said when I left that it was good for Stoke to have a fresh manager. Well, I think this was good for me as well. We've been congratulated on the football we've played, which has been lovely, but we've played to the strengths of the team.\"\n\nParish concurs: \"What Tony's proved to everybody is that he's not a one-dimensional manager. We don't hoik it up to the big man up front and play off second balls. He's developed a completely different style to what he had at Stoke based around the personnel he's got.\"\n\nThe players head inside for a warm-down and yoga (one compulsory and one optional session a week) while data gathered from monitors strapped to their chests is pinned to noticeboards and physio Alex Manos manages their fluid levels. Lunch is served around 1pm and the day winds down.\n\nPalace have never experienced a second season in the Premier League and seem aware of how critical the coming months will prove - with signings, contract renewals and improvements to the training ground and stadium among the items to tick off an ever-growing to-do list.\n\n\"There's another two years left on my contract,\" Pulis divulges. \"I've got to sit down with Steve and talk about the future, what we've got to try to do.\n\n\"The club needs an upgrade everywhere. If you look at the training ground, if you look at the stadium, if you look at everything behind the scenes, the infrastructure, it needs an upgrade.\n\n\"When I was first at Stoke we didn't have facilities at the training ground, the pitches were poor, everything about it was so basic. To go there now and see what they've got is wonderful.\n\n\"The crowd have been amazing, but at Stoke they are still unbelievable six years on. The Palace fans have to be the same next year, the year after and the year after. They'll play an important part.\n\n\"We're in a better position than when I came in. It would be crazy to walk away, but there has to be a plan and some structure towards that plan.\"\n\nThere has been constant speculation about how well Pulis and Parish actually get on, but so long as Palace move in the right direction then you get the impression both men will be content.\n\n\"I want to make sure that when relegation is mentioned at the start of next season we're not one of the clubs people think are even in the mix,\" Parish concludes. \"There are things that have to be done, but the priority is the team and establishing ourselves as a real force in this league.\n\n\"It's about finding the best way to invest wisely. I think we've got the right manager to do that. Tony's got a really clear vision of the type of player he wants and how he wants to play. We want to keep the nucleus of the team but need to bring a bit of quality, we need more goals.\n\n\"As good as we've been, people will find a way round that. You've got to have more than one way of playing in the end. But after all the trials and tribulations of the last 20 years for the club, it's fabulous.\n\n\"Crystal Palace Football Club means something. Crystal Palace Premier League Football Club means a lot more out there in the big wide world.\"\n\n* All statistics correct as of Friday 2 May."}