{"url": "https://www.bbc.com/sport/football/30677030", "title": "David Moyes: Real Sociedad boss wondered how to beat Barcelona", "description": "David Moyes admits he always wondered how to \"possibly get a result\" against Barcelona after Real Sociedad's 1-0 win.", "content": "David Moyes admits he had always wondered how to \"possibly get a result\" against Barcelona after his Real Sociedad side beat the Catalans 1-0.\n\nIn his first match against the four-time European champions, the former Manchester United boss guided Sociedad to just a second La liga win under him.\n\nMoyes said: \"The win feels similar to the early days at Everton.\n\n\"How was I ever going to get a result against the likes of Arsenal, Liverpool, Man United at that time?\"\n\nJordi Alba's second-minute own goal proved decisive as Sociedad's brave defensive effort stopped Barcelona from going top of La Liga, after Real Madrid's loss at Valencia earlier in the day.\n\nThe victory moved Moyes's men up four places to 13th in the league with the Scot losing just once in six league games since being appointed in November.\n\nMoyes was sacked by Manchester United only 10 months after succeeding Sir Alex Ferguson.\n\n\"We've talked about Barcelona at my past clubs, at Everton and at Manchester United. I've watched them with admiration and we used to wonder how to possibly get a result against them,\" said Moyes.\n\n\"Tonight I had the opportunity; it was a long night, we scored early and I would like to have given them a harder game. We did make it very difficult for them, though.\n\n\"I would like to be competing against Barca, Real Madrid, Atletico, Valencia and Sevilla at the top of the league. To do that we have to make the squad stronger.\"\n\nBarcelona manager Luis Enrique surprised many with his team selection, leaving Lionel Messi, Neymar and Dani Alves on the substitutes' bench as La Liga resumed after a fortnight's winter break.\n\n\"I expected Neymar and Messi to maybe be on the bench,\" said Moyes. \"I've managed a very big club, you have a big squad and a lot of games. The big games come later for these teams - April time - and you have to give the big players rest to keep them fresh for then.\n\n\"I thought Luis Enrique made the right decision and the players that played tonight are really good players. He knows his squad the best and in his position I would probably have done the same thing.\n\n\"The winter break should definitely be considered in the Premier League. We're able to give the players a week off, then we came in and trained for a week before tonight. It would be great for the teams in England and great for the managers as well, to feel they could have a break after that hectic Christmas period.\""}