{"url": "https://www.bbc.com/sport/football/24013102", "title": "Craig Bellamy: Wales & Cardiff City striker hints at retirement", "description": "Wales and Cardiff City striker Craig Bellamy hints that he may retire from football at the end of the season.", "content": "Wales and Cardiff City striker Craig Bellamy says he could retire from football at the end of this season.\n\nBellamy won his 75th Wales cap in Friday's disappointing 2-1 defeat by Macedonia in Skopje.\n\n\"My mood does change... I know I could change what I'm thinking,\" said Bellamy, 34.\n\n\"But the way I'm feeling now, it could be my last season in football. I have so much to look forward to after football.\"\n\nHe added: \"Life isn't just about football. The adventure starts when you finish and I'm looking forward to that.\n\n\"I've been playing at a professional level for 17, 18 years now and there's more to life. I love the game, don't get me wrong, I've cherished every moment of it.\"\n\nBellamy has previously hinted he is ready to walk away from international football at the end of Wales' current World Cup qualifying campaign - they play Belgium at the King Baudouin Stadium, Brussels, on Tuesday, 15 October.\n\nChris Coleman's side have managed only two wins - both against Scotland - from seven games in Group A, but Bellamy believes the future is bright for Wales with players of Gareth Bale, Aaron Ramsey and Jonathan Williams to call on.\n\nHowever, the Cardiff City forward, while not completely ruling out a change of heart, is not tempted to prolong his international career for one more campaign as he wants to spend more time with his children.\n\n\"I don't think that's going to be possible,\" said Bellamy.\n\n\"I really want this group to succeed, but it's a two-year period to qualify and if I start (the campaign) then step aside, it is robbing someone else of two or four matches, of vital experience, and they would miss out as well.\n\n\"That's the way I'm looking at it. I honestly think Wales have a great chance of doing something, but I've thought about it really hard.\n\n\"It's difficult. I'm a single parent now and I'm having such a battle to see my kids on a daily basis. It's so hard. Then, being away for 10 days. I'm not the only dad who has to go through it, but if you have experienced it then you would understand.\"\n\nBellamy has revealed he is considering moving into football management once he hangs up his boots for good.\n\n\"I've got my A licence already, then I'm doing my pro-licence,\" he said.\n\n\"After that, I'm going to travel around the world - Spain, Argentina - and learn my craft. I don't just want to go in and mess about. When I go in, I'm going to be prepared and I'm going to stay in.\""}