{"url": "https://www.bbc.com/sport/football/29954300", "title": "Real Madrid 5-1 Rayo Vallecano", "description": "Cristiano Ronaldo scores for the 10th league game in a row as leaders Real Madrid thrash Rayo Vallecano 5-1.", "content": "Cristiano Ronaldo scored for the 10th straight league game and Gareth Bale found the net on his return from injury as Real Madrid crushed Rayo Vallecano to restore their two-point league lead.\n\nBale opened the scoring when he turned in a low cross from Toni Kroos.\n\nSergio Ramos made it 2-0 from a corner but Alberto Bueno pulled one back after a James Rodriguez mistake.\n\nKroos scored from 25 yards and Karim Benzema tapped in before Ronaldo scored a breakaway goal to complete the rout.\n\nThe Portuguese star now has a staggering 23 goals in all competitions this season, including 18 in 10 league appearances.\n\nReal had briefly been deposed as league leaders by Barcelona on Saturday, but responded in typical style.\n\nBale, preferred to Isco in the starting line-up after recovering from a muscle injury, took only nine minutes to get on the scoresheet.\n\nRonaldo fed Kroos down the left and the German's low cross left Bale with a simple tap-in.\n\nBenzema headed against the bar from a corner, but Real extended their lead from the next set-piece as Ramos stuck out a thigh to loop the ball past Cristian Alvarez.\n\nOn the stroke of half-time, James Rodriguez handed the visitors a life-line as he inexplicably gifted the ball to Leo Baptistao.\n\nRayo's top-scorer calmly passed to Alberto Bueno, who rounded goalkeeper Keylor Navas and slotted home.\n\nAny danger to Real's supremacy was snuffed out in the space of four second-half minutes. Ronaldo set up Kroos to curl a fine low shot into the corner, and Benzema tapped in the Portuguese's cross, albeit from an offside position.\n\nRonaldo's inevitable goal arrived seven minutes from time as he burst onto Isco's through-ball, cut inside and released a shot, which squirmed under Alvarez's body."}