{"url": "https://www.bbc.com/sport/football/43762695", "title": "Carlisle United 1-1 Luton Town", "description": "Luton Town are promoted back to League One after a 1-1 draw with Carlisle United.", "content": "Luton Town were promoted back to League One after a 1-1 draw with Carlisle United.\n\nThe Hatters only had to match the result of fourth-placed Exeter and their 2-2 draw with Crawley meant a point was enough for the Kenilworth Road side.\n\nThey went behind when Danny Grainger scored from the penalty spot but Olly Lee levelled after the break.\n\nPromotion ends a 10-year spell outside the top three tiers.\n\nThe Hatters started the season with an 8-2 home win over Yeovil and have been in the top three since a 7-0 win at home to Cambridge United on 18 November.\n\nWith 91 goals, they are the second-highest scorers in England's top four divisions, three goals behind Premier League winners Manchester City.\n\nFive of their players - striker Danny Hylton, midfielder Luke Berry, defender Alan Sheehan, full-back Dan Potts and goalkeeper Marek Stech - were named in the PFA's League Team of the Year on Tuesday.\n\nPromotion to League One ends Luton's decade outside the top three tiers of English football.\n\nThey were relegated to League Two in April 2008 and were relegated out of the Football League altogether the following campaign after being deducted a record 30 points for entering administration for the third time in a decade.\n\nJohn Still guided them to promotion out of the National League in 2013-14 before he was replaced by Jones in December 2016.\n\nThe Welshman led the team to a fourth-placed finish last season, before they lost to Blackpool in the play-offs but there will be no such heartache this time.\n\n\"We are back where we belong and it would have been a travesty if we had not been able to do it automatically.\n\n\"There will be an orange party on the way home down the M6. I have a mix of emotions - delight and pride, relief and euphoria, the whole range.\n\n\"Credit to Accrington, who have been outstanding this year. The fact we have kept pace means we are a very good side and we are ready for the next league and that is the best thing about it.\n\n\"Carlisle are a good side at this level and have some very good players. But apart from the first 20 minutes we played well and had the better chances.\n\n\"Today has been brilliant for the players and the fans. It's probably the best day of my life. The fans deserve this. We learnt a lesson from last year and signed well. We weren't good enough to finish in the top three then, but we learnt from our mistakes.\""}