{"url": "https://www.bbc.com/news/uk-wales-20991223", "title": "Operations off in winter pressure", "description": "Non-emergency operations are cancelled in north and south Wales due to a seasonal rise in winter illnesses putting pressure on NHS hospitals.", "content": "Non-emergency operations have been cancelled in north and south Wales due to a seasonal rise in winter illnesses putting pressure on NHS hospitals.\n\nSome hospital managers say they have seen \"significant increased pressures\" since Christmas and others report that A&E admissions have risen 20%.\n\nCommon complaints are flu as well as other respiratory problems.\n\nHowever, Public Health Wales reports that the number of flu cases is within expected levels for the time of year.\n\nSeveral acute hospitals report cancellations of non-emergency procedures and delays to deal with the influx.\n\nIn north Wales, Betsi Cadwaladr University Health Board (BCUHB) says \"significant increased pressure\" at its hospitals has led to the cancellation of some non-urgent elective treatment.\n\nOfficials say most non-emergency operations remain cancelled at Prince Philip Hospital in Llanelli, Glangwili in Carmarthen, Withybush in Haverfordwest and Bronglais in Aberystwyth. They are reviewing the situation daily.\n\nAbertawe Bro Morgannwg University Health Board says A&E units at Swansea's Morriston Hospital and the Princess of Wales Hospital, Bridgend, are \"extremely busy\" with the number of patients admitted up to 20% higher than normal.\n\nIt is leading to delays for other A&E admissions and some cancellations of planned operations.\n\nCardiff and Vale University Local Health Board has been asked to comment on the situation at the University Hospital of Wales.\n\nRoyal Gwent Hospital, Newport, and Nevill Hall Hospital, Abergavenny, have also had to cancel some operations, according to Aneurin Bevan Local Health Board.\n\nCwm Taf Health Board, which covers the local authority areas of Merthyr Tydfil and Rhondda Cynon Taf urged people to visit their local hospital A&E departments only in an emergency.\n\nDr Paul Worthington, chief officer for patient watchdog Cwm Taf Community Health Council, said local hospitals were \"flexing their bed capacity\" to cope with increased levels of demand on the NHS.\n\nHe said some hospitals were operating at 90% bed occupancy levels.\n\nIn north Wales, hospitals are also increasing the number of beds available.\n\nA BCUHB spokesperson explained: \"Since the Christmas period, the health board, in common with many parts of the NHS in Wales, has seen significant increased pressures due to the nature of illnesses circulating in the community, many with respiratory conditions or flu.\n\n\"This has put increased pressure on beds as patients have needed longer stays in hospital than normal, which has resulted in some delays in admitting patients and within the emergency department.\n\n\"We have had to make the decision based on clinical priority to cancel some non-urgent elective work to respond to the pressures we are facing.\"\n\nHe said the health board was working with the Welsh Ambulance Service, GPs and social services to minimise delays wherever possible with additional space being opened within hospitals to \"help alleviate some of the bed pressures\"."}