{"url": "https://www.bbc.com/news/uk-22141396", "title": "McCluskey re-elected as Unite leader", "description": "The general secretary of the UK's biggest trade union is re-elected for another five-year term of office.", "content": "The general secretary of the UK's biggest trade union has been re-elected for another five-year term of office.\n\nLen McCluskey received 144,570 votes compared with almost 80,000 for the other candidate, Jerry Hicks.\n\nMr McCluskey, who has been Unite's general secretary since 2010, called the election early saying he did not want it to clash with the general election in 2015.\n\nThe 62-year-old former Liverpool docker will be leader of Unite until 2018.\n\nMr McCluskey said he was \"honoured\" to have been elected for a second time.\n\n\"We are living in extraordinary times with workers facing unprecedented attacks on their living standards and their rights at work. Now more than ever working people need a union which will stand up for them.\"\n\nMr McCluskey has been an active trade unionist since 1968 becoming an officer of the Transport and General Workers Union in 1979 and then national secretary for the General Workers group in 1990.\n\nIn 2004 he was promoted to become the union's national organiser for all the service industries, including public services, construction and the voluntary sector.\n\nMr McCluskey later became Unite's assistant general secretary for industrial strategy. He has been a member of the Labour Party for more than 40 years.\n\nThe election result was much closer than expected, with the turnout just over 15%. It was called by Mr McCluskey with two years left of his term to run.\n\nSince his election as general secretary in 2010 the Unite leader has set up a £25 million dispute fund to support union members financially and overall membership to the union has risen since his appointment.\n\nHe has been an outspoken critic of Ed Miliband's leadership despite having played a key role in getting him elected.\n\nUnite, the Labour party's biggest financial donor, was one of several unions that criticised the shadow chancellor Ed Balls and the Labour leader Ed Miliband for backing the ongoing pay restraint in the public sector.\n\nAccording to Mr McCluskey, the party needs to \"put some flesh on the framework of an alternative\" and warns that if that alternative is not radical enough, Labour will lose the next election.\n\nIn 2012, Mr McCluskey was heavily criticised for raising the possibility of protests during the Olympics with the Conservatives describing him as \"unpatriotic\".\n\nIn an interview before the conference, he told the BBC that he did not regret his comments about the Olympics despite the subsequent backlash.\n\nHe said he wanted a successful Olympics, and he expected protests against the government's austerity programme to continue long after the Games were over.\n\nOn the recent benefit and tax changes announced by chancellor George Osborne Mr McCluskey said: \"The sight of the chancellor exhorting the low waged in work to turn their backs on the poor out of work has to mark a new low for one of the highest offices in the land.\"\n\nHis opponent Mr Hicks, from Bristol, is an unemployed rank and file member of Unite.\n\nHe received 163 nominations to stand in the election, compared with more than 1,000 for Mr McCluskey.\n\nJerry Hicks also stood against Mr McCluskey in the 2010 Unite election when he again came second but with 52,000 votes.\n\nUnite has 1.5 million members and was formed by the merger between two of Britain's leading unions, the Transport and General Workers Union and Amicus.\n\nUnite represents workers in a wide range of fields from nurses and teachers to bank staff and bus drivers."}