{"url": "https://www.bbc.com/news/uk-wales-south-west-wales-43576560?intlink_from_url=&link_location=live-reporting-story", "title": "Gower dark sky potential explored", "description": "A new study says night skies are so clear the naked eye can pick out other galaxies from the Gower.", "content": "Campers and amateur astronomers may soon have another area of Wales officially protected for stargazing.\n\nGower has been found to have potential for 'Dark Sky' status after being tested for light pollution.\n\nAbout 40 locations were measured on a moonless night in December, with the darkest spots further west.\n\nThe study recommends the Area of Outstanding Natural Beauty should strive to be recognised as a Dark Sky reserve.\n\nThe status, granted by the International Dark Sky Association, means the night-sky is protected and lighting controls are in place to prevent light pollution.\n\nOther reserves have claimed the recognition brings boosts tourism and local economies, while the lower light pollution leads to wildlife and health benefits.\n\nIf granted, it would follow the Brecon Beacons and Snowdonia in having the designation, with the Clwydian Mountain Range moving towards a bid in the future.\n\nThere are 12 dark sky reserves across the world.\n\nThe study, by Dark Sky Training Services noted that the readings for the AONB \"are very encouraging\", with the naked eye able to spot the Milky Way and the Andromeda Galaxy, among other celestial objects.\n\nDark Sky Training Services recommended holding discussions with Swansea and Carmarthenshire councils about ways of reducing light pollution from Mumbles, Swansea, Llanelli and Burry Port to further Gower's eligibility for the Dark Sky reserve status.\n\nThe Gower AONB Partnership Steering Group, which comprises Swansea Council and other organisations, agreed to take forward the Dark Sky Community recommendation at a meeting on March 26.\n\n\"It was decided that we would do everything we could to bring it about,\" said councillor Paxton-Hood Williams. \"There is potential from a tourism point of view.\"\n\nAchieving the status would require further light pollution surveys, a lighting management scheme and backing from businesses and landowners among other hurdles."}