{"url": "https://www.bbc.com/news/uk-44165718", "title": "Ex-spy Skripal discharged after poisoning", "description": "The Russian exile and his daughter were found slumped on a bench in Salisbury on 4 March.", "content": "Russian ex-spy Sergei Skripal has been discharged from hospital, two months after being poisoned with a nerve agent in Salisbury.\n\nThe 66-year-old was found slumped on a park bench in the city on 4 March, with his daughter Yulia.\n\nThey were taken to Salisbury District Hospital's intensive care unit, where they were stabilised after being exposed to Novichok.\n\nMs Skripal was released on 9 April and was moved to a secure location.\n\nIt is not known whether Mr Skripal has been taken to the same location as his daughter.\n\nBBC home affairs correspondent Daniel Sandford said he understood that Mr Skripal is able to walk, and has talked to police at length, but is not completely recovered.\n\nHe said police sources indicated that the investigation could take months of carefully piecing together movements of people and cars from mobile phone records, CCTV, automatic number plate recognition and passenger flight records.\n\nThe Metropolitan Police said its investigation into the attack continued and it would not \"be discussing any protective or security arrangements that are in place\".\n\nDirector of nursing Lorna Wilkinson said treating the Skripals had been \"a huge and unprecedented challenge\".\n\nShe added: \"This is an important stage in his recovery, which will now take place away from the hospital.\"\n\nRussian ambassador to the UK Alexander Yakovenko welcomed the news that Mr Skripal had been discharged, and repeated his demand for consular access to the former spy and his daughter.\n\nAt a news conference at his official residence in London, Mr Yakovenko said: \"We are happy that he is all right.\"\n\nThe Russian ambassador has previously claimed the UK is violating international law by not granting access to the Skripals.\n\n\"If they don't want our assistance, that's fine, but we want to see them physically,\" he said.\n\nBritain expelled 23 Russian diplomats in response to the attack in Salisbury, but Mr Yakovenko and others remain.\n\nDS Nick Bailey - the police officer who first attended the Skripals on the day of the poisoning - was also treated for exposure to the nerve agent, but was discharged in March.\n\nClinicians at the hospital had to keep the Skripals alive while their bodies could produce more enzymes to replace those that had been poisoned.\n\nWhen Sergei Skripal and his daughter Yulia were left in a critical condition, it seemed improbable that the two would survive.\n\nNow, less than three months on, both have been discharged from hospital.\n\nTheir personal safety will be a priority for the police - the two have been taken to a secure location.\n\nDetectives are continuing to investigate the attempted murder of the Skripals, though so far no suspects have been named.\n\nThey will have spoken at length to both Sergei and Yulia about what happened and why they may have been targeted.\n\nBut police say they are still working to establish the full facts of the attack.\n\nThe UK government has blamed Russia for the attack, with Prime Minister Theresa May describing the incident as \"brazen\" and \"despicable\".\n\nBut the Russian government denied any involvement and has accused the UK of inventing a \"fake story\".\n\nForeign Secretary Boris Johnson is due to speak at a conference in Paris on Friday intended to fight against impunity for the use of chemical weapons.\n\nSpeaking before the conference, he said: \"Assad's brutality in Syria and the attempted murders in Salisbury pose a grave threat to the Chemical Weapons Convention and to the rules-based order that keeps us all safe.\"\n\nIn 2006 Mr Skripal, a former Russian colonel, was jailed in Russia for 13 years for passing on the identities of Russian spies in Europe to the UK intelligence services.\n\nBut in 2010 he was part of a prisoner swap between Moscow and the United States. He eventually settled in Salisbury.\n\nWhen Ms Skripal was released she refused assistance from the Russian embassy, who claim they had been denied consular access to a Russian national.\n\nRecently the director general of MI5, Andrew Parker, publicly blamed Russia for the \"reckless\" poisoning, accusing the Kremlin of \"flagrant breaches of international rules\".\n\nThe investigation into the nerve agent attack saw the closure of areas of Salisbury, as police and specialist investigators identified where the Skripals were poisoned.\n\nThe highest concentration of the Novichok was found at the Skripals' front door.\n\nA multimillion pound operation to decontaminate nine locations in the city is under way. Two places that the Skripals visited - the Mill pub and a Zizzi restaurant - are among the places deemed to be still at risk."}