{"url": "https://www.bbc.com/news/business-44645573?intlink_from_url=&link_location=live-reporting-story", "title": "Deal close over UK's biggest steel plant", "description": "Tata Steel, which owns the Port Talbot steelworks, and ThyssenKrupp are close to agreeing terms on a merger.", "content": "Tata Steel and ThyssenKrupp are close to agreeing terms on a merger that will create Europe's second-biggest steelmaker, after Arcelor Mittal.\n\nSenior City sources said the deal - which has been under negotiation for more than a year - could be concluded in the next few days.\n\nIt will see Tata Steel's UK plants merged into a pan-European venture with annual sales of about £13bn.\n\nThese include the politically sensitive Port Talbot works in Wales.\n\nTalks have been held up while the future of Tata Steel's enormous pension scheme - which includes the former British Steel retirement plan - was decided.\n\nThree months ago, the pensions regulator approved the creation of a new pension fund after Tata agreed to a £550m top-up.\n\nMore recently, ThyssenKrupp has faced pressure from shareholders to secure better terms from Tata.\n\nElliott Management, the aggressive New York hedge fund that has emerged as a key player in big European takeover battles, recently wrote to Thyssen's board saying that Tata's recent financial results did not warrant it receiving a half-share in the combined business.\n\nThe deal marks another change of ownership for Britain's steel industry, which once led the world, but has shrunk rapidly in the face of cheaper international competition.\n\nMost of the industry was nationalised after World War Two, then re-privatised in 1988 as the British Steel Corporation.\n\nIt became Corus after a merger with a Dutch rival, Koninklijke Hoogovens, in 1999, and was bought by India's Tata Steel in 2006.\n\nThe British Steel name was revived two years ago, when investment fund Greybull Capital bought Tata Steel's Scunthorpe-based long-products division.\n\nTata and ThyssenKrupp have both said they are committed to the Port Talbot plant, which is Britain's largest remaining steel plant.\n\nBut steel industry experts said there remained question marks over the site's long-term future."}