{"url": "https://www.bbc.com/news/science-environment-44501058", "title": "Animals with 'night vision goggles'", "description": "Could you survive in pitch-black conditions? Meet the animals that not only survive but thrive.", "content": "A tarsier is known for its big, beady eyes, but it's only when you look at a skull of this diminutive South East Asian primate that you realise just how big they are.\n\nEach one is the same size as its brain. They can't move their eyeballs; if they want to look to the right or left they have to turn their whole head. But the mere fact that tarsiers have these monster organs tells you one thing: vision is very important to them.\n\nThe animal is a master in the dark, able to see and snaffle insects and small birds even when it seems impossibly dark.\n\n\"Theirs is a monochrome world; the back of their eyes are packed with photoreceptor rods, not cones, so they can gather every last photon of light,\" explains Prof Geoff Boxshall from London's Natural History Museum.\n\n\"Their eyes are the animal world's equivalent of night-vision goggles.\"\n\nGeoff is the science lead on a new exhibition opening at the NHM in July that will celebrate Life In The Dark.\n\nThere is an amazing diversity of creatures out there with some incredible tricks, to not only survive but also thrive in the absence of light.\n\nThe museum has pulled the best of them from its collections. Some you'll know but hadn't perhaps considered the genius of their adaptations - such as bats.\n\nSome creatures will definitely be new to you because they've only recently been discovered. There's some truly bizarre stuff living in caves and in the deep ocean, for example.\n\nTake the threadfin dragonfish. It lives at mid-depths where sunlight from above is all but extinguished. So, it makes its own light. Bioluminescence.\n\nIt has light-producing organs, or photophores, on its underside that match the wavelength and amplitude of any stray light that does manage to penetrate to its location - and this counter-illumination effectively hides it from any predator that might be looking upwards. But the threadfin dragonfish is not finished there.\n\nIt has a set of \"head-lamps\" just behind the eyes. These it's able to flash on and off. What for is not entirely clear. \"If you're in the deep and it's pitch black and you see a light - it could be a predator wanting to eat you; it could be something glowing that you could eat; or it could be a potential mate. It's Russian roulette. I really like that aspect of it,\" said Geoff.\n\nOne of the darkest environments of all is the cave and so it's no surprise their inhabitants will feature in the exhibition. One of the strangest is the remipede.\n\nIt looks a bit like a centipede except it's not. It's a whole new class of crustacea (lobsters, crabs, shrimp, etc) that lives in undersea caves.\n\n\"Class is actually quite a high category. Birds are a class; mammals are a class,\" explained Geoff. \"You find them in flooded marine caves, mostly around the Caribbean; the Yucatán, Gulf of Mexico. They've been found in a flooded lava tube in Lanzarote.\n\n\"They're blind; they have these long antennae, and a curtain of chemosensory hairs to 'sniff' for prey. They sense disturbance in the water. The latest genetic information suggests they are the nearest relative to the insects.\"\n\nIf what look like creepy-crawlies are not your thing, the exhibition will feature the cute and cuddly as well.\n\nTop of the list is the dormouse. It gets an entry because of the way it uses its whiskers at night. This is really new science, led by Dr Robyn Grant at the Manchester Metropolitan University.\n\nShe uses super slow-mo cameras in dormice climbing arenas to watch their \"whisking\" behaviour. The animals flick these hairs back and forth 10 times a second, working out where it's safe to put their feet.\n\n\"Dormice have quite big eyes, but can't really rely on them at night,\" says Robyn. \"They use their whiskers to scan ahead. When they come to gaps in the hedgerows, they palpate with their whiskers. If they can feel the other side, they'll be very happy.\n\n\"If they can't and they have to jump, they do so with their whiskers outstretched like collision detectors. So, they touch the other side with their whiskers first and then aim to get their feet down.\"\n\nA lot of other small mammals, such as harvest mice, rats, shrews and voles, probably also use their whiskers in the same way. Robyn got her PhD working with engineers who wanted to develop tactile sensors for robots to do texture discrimination. You can see the cross-over.\n\nIn the past few days, a study has suggested human activity may actually be driving many mammals into the dark.\n\nAnimals ranging in size from the little opossum to the mighty African elephant appear to have increased their nocturnality to try to avoid people.\n\nThe shifts in many cases are not large but could be significant, say scientists. And while the change may help us all coexist as human settlements expand, there are almost certain to be detrimental consequences for some animals.\n\nMany apex predators hunt by sight, for example. If they're forced to do more of this activity at night, they may not be quite so successful.\n\nLife In The Dark opens at the Natural History Museum on 13 July and runs to 6 January.\n\nJonathan.Amos-INTERNET@bbc.co.uk and follow me on Twitter: @BBCAmos"}