{"url": "https://www.bbc.com/news/uk-wales-politics-18514829", "title": "Health bailouts 'unsustainable'", "description": "Last-minute cash bailouts given to several Welsh local health boards to help them break even are \"unsustainable\" warns a finance watchdog.", "content": "A finance watchdog has warned that £24m in cash bailouts given to four Welsh local health boards (LHBs) are \"unsustainable\".\n\nAneurin Bevan, Cwm Taf, Cardiff and Vale and Powys Teaching boards got £24m in Welsh government loans in March, said the auditor general.\n\nMinisters have denied a bailout and say LHBs will have to pay the money back.\n\nA patients' group said LHBs needed to be transparent about how problems might affect people.\n\nThe Welsh government has also said the boards face an inquiry into their savings plans.\n\nAuditor general Huw Vaughan Thomas said that as a result the LHBs now faced larger deficits to make up this year.\n\nMr Thomas said that without the emergency loans the boards in questions would have failed in their legal duty to break even at the end of the last financial year.\n\nThe extent of the funding gap faced by six of the seven boards in this financial year has been revealed:\n\n\"The 2011-12 financial year presented every health board in Wales with significant financial challenges because of the downward pressure on funding and the continuing upward pressure on service demand,\" said Mr Thomas.\n\n\"In my view, the historical pattern of the Welsh government providing health boards with additional funding in year to manage deficits is not sustainable.\n\n\"That said, there are positive signs that the NHS in Wales is prepared to take the tough choices needed to deliver long-term change, although clearly it is a very challenging agenda.\"\n\nMr Thomas said he would be shortly publishing his Health Finances report, which would provide a more detailed assessment of the financial position across NHS bodies and the financial challenges that the NHS in Wales faces.\n\nA Welsh government said the Wales Audit Office recognises the achievement of NHS organisations in meeting their financial targets and that ministers had taken a \"prudent course of action\" to support them.\n\n\"It is important to note that the additional funding was not a bailout,\" said a spokesman.\n\n\"The health boards were allowed to draw down a small percentage (0.2%) of the future year's funding in order to provide some flexibility to manage their finances across the financial year end.\n\n\"As a condition of this flexibility, an external financial review of these organisations' financial plans has been commissioned.\n\n\"We are investing more than 43 per cent of the total Welsh government budget in health and social services - despite significant cuts to our budget by the UK Government.\"\n\nBut Plaid Cymru finance spokesman Ieuan Wyn Jones AM said ministers should focus on sorting out financial mismanagement within the health service.\n\n\"The Welsh government is clearly failing to control its spending,\" he said. \"Bailouts have doubled in just three years, and yet the Labour health minister has failed to get to grips with the situation.\"\n\nCarol Lamyman-Davies, director of the Board of Community Health Councils in Wales, told BBC Wales:\n\n\"What it does highlight to patients is that many services are unsustainable at this time. Change is inevitably going to happen.\n\n\"Health boards need to be open and transparent about the increasingly difficult problems they are facing.\""}