{"url": "https://www.bbc.com/news/science-environment-25005726", "title": "UK-built cameras heading for space station", "description": "The UK's Rutherford Appleton Laboratory has built a high-resolution camera system for Canadian company Urthecast to stream video of Earth from the space station.", "content": "Monday sees the launch to the space station of two cameras that are sure to provide some fascinating new views of Planet Earth.\n\nOne in particular will catch people’s attention because it will send down high-definition video.\n\nIf pre-launch simulations are accurate then the imagery from this particular piece of hardware will – I’m sure – be seen regularly on the evening TV news.\n\nAt a resolution of 1m per pixel, you will be able to observe large crowds and moving vehicles.\n\nThink of major world events: the aftermath of Typhoon Haiyan or the protests in Egypt's Tahrir Square – these would be given a fresh perspective with video tracking from above.\n\nThe cameras have a particular interest for this column because they have been built in the UK at the Rutherford Appleton Laboratory.\n\nThe Oxfordshire lab has a proud history in making and testing space equipment.\n\nIt was approached by Canadian start-up UrtheCast (pronounced “Earth-cast”) to provide the cameras for an unused attachment point at the rear of the ISS.\n\nUrthecast was offered the position by the Russian space agency, which wants to see the station exploited to the maximum extent.\n\nThe medium-resolution camera (MRC) can resolve details down to about 5m across, covering a swath of some 50km.\n\nIt is essentially a rebuild – with modifications – of a space camera that RAL produced for a previous customer.\n\nThe high-resolution video camera (HRC), on the other hand, is more bespoke, although it incorporates a lot of off-the-shelf components.\n\nNot that you can just buy stuff and stick it in orbit. Some re-engineering for the extremes of the space environment is almost always necessary.\n\nThis can mean exchanging certain materials or individual systems, and RAL has had to do this with the HRC's big telescope, for example.\n\nIt was commercially available but its carbon fibre tubing has been upgraded to cope with the stress of being in a vacuum and exposed to large fluctuations in temperature.\n\n“But using off-the-shelf has allowed us to do this project very quickly, in less than two years,” says Ian Tosh, who’s managed the project at RAL.\n\nThe cameras are currently at Baikonur, Kazakhstan, waiting for a Progress freighter to take them to the ISS.\n\nOnce there, spacewalking astronauts will bolt them to a prepared rig on the Zvezda module. We should see the first stills and videos in the New Year.\n\nUrthecast went public back in the summer, raising some $46m to support its ISS cameras project. It currently has distribution deals worth over $20m.\n\nIts business model has broadly two tracks. The first is fairly conventional: it will be selling commercial imagery of Earth to whoever wants it. This is now a pretty mature, and increasingly competitive, market.\n\n“The other half of the business model is to take the data, process it and stream it over the web as fast as we can – in near real-time,” explains Urthecast president Scott Larson.\n\n“We will allow other developers to makes apps, games, content and educational tools, and change-detection-type tools, all based on our open-source API (application-programming interface),” he told me.\n\nThe company is very keen to drive a buzz around its products, and the web portal will play heavily on social media, allowing people to tag imagery and link their own content.\n\n“Everyone in the world is going to go to the website at least once. Why wouldn’t you?” says Larson. “But we want to create an experience that makes people come back time and time again.” The portal will have a search facility that allows you to find the imagery most relevant to you, and if lots of people keep going back “time and time again”, it then becomes an attractive advertising medium.\n\nThe ISS is increasingly being used for Earth observation. It’s quite a challenging undertaking, though.\n\nThe space station is akin to a wobbling sausage. Every time an astronaut gets on an exercise bike, the whole platform starts to flex. There is also a constant vibration. All this requires the Urthecast cameras to have dampers built into their rig to maintain a steady shot.\n\nWatch out for the first videos when they come down. The HRC will be programmed to pick out and lock on to a spot on the ground as the ISS rolls overhead.\n\nThe frame rate will be about three per second, and depending on cloud conditions and viewing angle, the scenes should last about 90 seconds.\n\nUrthecast hopes to be downlinking around 150 videos a day."}