{"url": "https://www.bbc.com/news/uk-wales-politics-30107474", "title": "Loan fund of up to £13m for airport", "description": "A loan fund of up to £13m is to be made available to Cardiff Airport to attract new airlines, BBC Wales understands.", "content": "A loan fund of up to £13m is to be made available to Cardiff Airport to attract new airlines, BBC Wales understands.\n\nThe first £3.5m of the loan, from the Welsh government, will be drawn down by the airport next year.\n\nWelsh ministers have described the loan as the most significant step since they bought the airport 18 months ago.\n\nOn Tuesday, First Minister Carwyn Jones said its future lies in long-haul flights, not competing with Bristol on closer destinations.\n\nBecause the funding is in the form of a commercial loan the airport will by-pass many of the EU regulations on state aid.\n\nThe last time such a fund was made available was in 2006 when £4m was used by the then privately-owned airport.\n\nCardiff Airport has had mixed fortunes under public ownership.\n\nIt was bought by the Welsh government for £52m in March 2013 and has invested about £10m in improvements at the terminal.\n\nA general decline in passenger numbers was halted, although figures for September showed a 7% reduction on the year.\n\nEarlier in November, the German airline Germanwings announced it was ending flights between Cardiff and Dusseldorf in 2015, following on from Cityjet scrapping a service to Glasgow.\n\nBut Ryanair has returned to the airport after an eight-year gap with a weekly flight to Tenerife.\n\nSpeaking on BBC's Good Morning Wales radio programme, Welsh Conservative assembly leader Andrew RT Davies said looking at the figures, the government had \"not done a very good job\" since taking over the airport.\n\n\"Regrettably, there's been a year-on-year decline of 7% in passenger figures. We know of a series of airlines that have chosen to pull out... and we know the most senior executive there, the managing director, left very quickly at the end of August,\" he said.\n\n\"There doesn't seem to be much stability there, but what we need to do is make sure an airport works for Wales and the Welsh economy.\"\n\nHowever he added he did welcome the route development fund announcement but said the government had been slow to put it in place.\n\n\"For an airport to be successful, you need airlines to use it and you also need those routes to bring people in as well as take people out because obviously the more people you bring in that's a greater boost to the Welsh economy,\" he said.\n\nOne of the huge challenges that we have had all along since the government announced it was going to buy the airport is how to try to challenge this highly successful commercial operation in Bristol airport, which has something like 5m passengers a year.\n\nCardiff is around the 1m mark.\n\nThe route development fund is an attempt to deal with that. We are moving into the second phase now following the decision to put the airport into public ownership.\n\nFrom a passenger's perspective, all they want to know about is what kind of routes and what kind of offer there is going to be and there is a big hope this can make a difference."}