{"url": "https://www.bbc.com/news/uk-wales-south-east-wales-20769589", "title": "Cardiff Airport in war and peace", "description": "With Cardiff Airport set to land back in the public sector with a Welsh government buyout, a look at the history of aviation from the city.", "content": "Cardiff Airport is set to land back in the hands of the public sector in the latest chapter of more than 80 years of aviation for the Welsh capital.\n\nThe Welsh government has announced that it plans to buy the airport from TBI, which is now owned mainly by the Spanish company Abertis.\n\nThe city has had an airport to call its own since 1931, and until 1954 air travellers flew from the original site at Pengam Moors, on the eastern side of the city.\n\nThe foundations of the current airport - some 15 miles from the city centre in the neighbouring Vale of Glamorgan - were laid in World War II with the need to train Spitfire pilots.\n\nBulldozers began clearing the site at Rhoose in 1941, and the airfield went fully operational in April 1942 as a satellite of RAF Llandow.\n\nIts commercial value was recognised in the following years when the main runway was opened in 1952 to accommodate the Aer Lingus service to Dublin.\n\nBy 1962, the charter holiday business had increased passengers numbers to 100,000 a year.\n\nThree years later, the government handed the keys over to the then Glamorgan County Council.\n\nPrince Philip opened the airport's new terminal building in 1972. The development included a control tower and the runway was doubled in length to cater for larger, wider, passenger jets on transatlantic runs.\n\nAs the range of charter flights grew, passenger numbers for these services passed 250,000 in the early 1980s.\n\nIn 1986 a further 750ft was added to the runway, allowing it to handle Boeing 747 jumbo jets.\n\nPassenger numbers for scheduled flights from the airport reached 100,000 per year in 1990 and overall passenger numbers at the airport were approaching 750,000 a year in 1993.\n\nCardiff Airport was privatised in April 1995. Its passenger numbers peaked at 2.7m in 2007.\n\nThe airport currently handles around 1.5m passengers a year travelling to and from more than 20 destinations."}