{"url": "https://www.bbc.com/news/uk-wales-12822603", "title": "BBC drama costs compared in audit", "description": "Auditors look at the value for money of some of the BBC's long-running drama series, including Welsh language soap Pobol y Cwm.", "content": "BBC Cymru Wales has responded to a National Audit Office (NAO) report into value for money of some of the BBC's top drama series.\n\nIt shows the cost per viewer hour of the Welsh language drama Pobol y Cwm is £2.15, compared to 3.5p for Eastenders.\n\nIt recommends the BBC strengthens its approach for achieving value for money.\n\nBBC Cymru Wales' acting director Keith Jones said the NAO acknowledged production costs are managed effectively and rigorously.\n\nFor the first time, the NAO looked at the cost of six series including Eastenders, Casualty, Holby City and long-running Welsh language soap opera Pobol y Cwm, which is produced by BBC Wales for S4C.\n\nThe report was commissioned by the BBC Trust, and examined how well the BBC was managing the cost of producing soap operas.\n\nCost per viewer hour is a measure used by the BBC in order to monitor value for money.\n\nHowever, the report points out that it can have its limitations and the focus on viewer numbers as the sole measure of value \"ignores other qualities important to a public service broadcaster\".\n\nMr Jones said: \"It's important to bear in mind that the cost per hour of Pobol y Cwm compares favourably with the other productions, and that is for a very high quality series that's recognised beyond Wales.\n\n\"Of course, the importance of the series goes further than statistics and figures - it's an important part of Welsh culture, developing scripting, acting and production talent,\" he added.\n\n\"We can also be proud of the fact that the viewing figures have increased over the past year and that the series is consistently one of the most popular programmes on S4C,\" said Mr Jones.\n\nOver the last eight years, average audience share for the four dramas networked across the UK on BBC One has steadily fallen, although the audience share for Pobol y Cwm on S4C has remained broadly stable.\n\nThe total annual cost of producing Pobol y Cwm in 2009-10 was £9.8m compared to £29.9m for Eastenders and £8.1m for River City, produced by BBC Scotland. In 2009-10, S4C contributed £1.1m towards BBC Wales for the production cost of Pobol y Cwm.\n\nThe report recommends the BBC strengthens its approach to achieving value for money in continuing drama by being more systematic in comparing and challenging production costs.\n\nAnthony Fry, BBC Trustee with lead responsibility for value for money said the report shows the BBC has made real progress in delivering value for licence fee payers.\n\n\"We accept the majority of the NAO's recommendations, with the exception of the suggestion that the BBC should set targets at drama level,\" said Mr Fry.\n\n\"We believe there is a risk that this could harm the BBC's ability to produce distinctive programming.\""}