{"url": "https://www.bbc.com/news/uk-wales-south-west-wales-13193781", "title": "Satellite City actor dies aged 90", "description": "Tributes have been paid to Welsh actor Islwyn Morris who played memorable roles in Satellite City and Pobol y Cwm.", "content": "Tributes have been paid to Welsh actor Islwyn Morris who has died aged 90.\n\nHe was best known to many for his role as Idris in the BBC Wales comedy Satellite City which was made in the 1990s.\n\nHe also appeared in High Hopes and played the part of David Tushingham in the Welsh-language soap Pobol y Cwm.\n\nBoyd Clack, who wrote and also starred in Satellite City, said Swansea-born Mr Morris was \"a great actor\" and \"a great man.\"\n\nMr Clack said: \"I worked with Islwyn on Satellite City for six years.\n\n\"Islwyn was a great actor, a great man, it was an honour to have known him and worked with him.\n\n\"He played my father in Satellite City. I lost my father when I was young and I thought of him in a few ways as being a father figure.\n\n\"For the first time he became recognised by people in Wales - he thought it was funny, he quite enjoyed it.\n\n\"He was very much a family man and his faith meant a lot to him. Being with him was a constant pleasure.\"\n\nMr Morris, who died on Tuesday, appeared in Pobol y Cwm over 25 years.\n\nKeith Jones, Director of BBC Wales, said he was one of Wales' most loved actors.\n\n\"As 'Tush' he was one of the defining faces of Pobol y Cwm, alongside characters such as Bella and Harri Parry,\" he said.\n\n\"He brought warmth and subtle comedy to this role and many other roles for the BBC.\n\n\"In recent years, he became popular with a new and different audience through the comedy series Satellite City and High Hopes.\n\n\"I'd like to pay tribute to his artistry and to the great contribution he made to BBC Cymru Wales drama.\"\n\nBethan Jones, BBC Wales' Acting Head of Drama said: \"Islwyn Morris was a wonderful actor who created memorable characters including the very dapper Mr Tushingham in Pobol y Cwm and the loveable Idris Price in the popular comedy Satellite City.\n\n\"Islwyn will always be remembered not only for his notable acting talent but for also being a true gentleman.\""}