{"url": "https://www.bbc.com/news/world-us-canada-39037249", "title": "Hospital saves baby hippo at US zoo", "description": "Cincinnati Zoo's premature baby hippo Fiona needed urgent treatment for dehydration.", "content": "Doctors from a children's hospital have helped save the life of a premature baby hippo at Cincinnati Zoo.\n\nThe ailing baby, named Fiona, had become dehydrated after refusing milk and required an urgent intravenous drip.\n\nFiona was born six weeks early to 17-year-old hippo Bibi on 24 January.\n\nAt birth she weighed 13 kg (29 lbs), which the zoo says is about half the previous lowest recorded birth weight for her species.\n\nThe normal range is 25-54 kg and at almost a month old she does not yet weigh 25 kg.\n\nZoo staff, who have been blogging about the little hippo's progress, said last week that she was teething.\n\nThe discomfort may have made her bottle feeding uncomfortable, they said.\n\nWhen she grew sick and lethargic, the local Cincinnati Children's Hospital Medical Center stepped in to help rehydrate her.\n\n\"Preemies have very tiny and unstable veins, and even though our vet team was able to get multiple IVs placed, the veins could not sustain the IV and would blow,\" said the zoo's curator of mammals Christina Gorsuch.\n\n\"Lucky for us, we're right next door to a world-class facility with a whole department dedicated to working with difficult veins.\"\n\nTwo members of the hospital's vascular team brought ultrasound equipment to the zoo on Friday and put an IV catheter into Fiona.\n\nIt lasted just 30 minutes before her vein ruptured, but the team were able to secure a line into one of her deep leg veins.\n\nKeepers have been monitoring the IV round the clock since then.\n\n\"Five bags of fluid later, Fiona is showing signs of recovery,\" Ms Gorsuch said.\n\n\"She is still sleeping a lot but has started to take bottles again and has periods of carefully-supervised activity. The catheter is still in place.\"\n\nBaby Fiona is being cared for close to her mother Bibi and father Henry, so the family can hear and smell each other.\n\nShe made the history books even before her arrival, when scientists at the zoo captured the first ever ultrasound image of a Nile hippo foetus.\n\nThe Vascular Access Team were delighted to help the diminutive beast, whose growing pains have charmed fans online.\n\n\"Like many people, we are rooting for Fiona!\" said clinical director Sylvia Rineair.\n\nCincinnati Zoo was in the news last year over the fatal shooting of gorilla Harambe after the animal grabbed a four-year-old boy who had fallen into his enclosure.\n\nThe shooting last May sparked angry reaction and prompted a social media backlash that saw the zoo temporarily delete its Twitter account.\n\nFiona isn't the first of Cincinnati's animal residents to get help from the local children's hospital.\n\nIn 2015, Ali the aardvark had CT and MRI scans at Cincinnati Children's after suffering from eye trouble.\n\nThe multi-talented team have also helped baby gorillas, and consulted on a polar bear pregnancy test."}