{"url": "https://www.bbc.com/news/business-44479926?intlink_from_url=&link_location=live-reporting-story", "title": "Royal wedding and hot weather boost sales", "description": "Retail sales grew much faster than expected last month, as the wedding and sunny weather helped spending.", "content": "The hot weather and royal wedding celebrations contributed to another strong rise in retail sales last month, official figures have indicated.\n\nRetail sales volumes rose 1.3% in May from the month before, the Office for National Statistics said, following April's increase of 1.8%.\n\nSales in May were up 3.9% from the same month a year earlier, a 13-month high.\n\nRetailers said the royal wedding and good weather had encouraged spending in food and household goods stores.\n\nThe ONS figures echo the findings of the latest survey from the British Retail Consortium, which also cited the weather and the royal wedding as factors lifting sales in May.\n\nThe stronger-than-expected data may bring some relief for the retail sector, which has seen a string of bad news recently from some high-profile names.\n\nLast week, House of Fraser announced plans to close 31 stores, while earlier this week, discount chain Poundworld went into administration.\n\nEarlier on Thursday, the company behind the Simply Be and Jacamo clothing brands, N Brown, said it was considering closing its 20 remaining shops and becoming a pure online retailer.\n\nAlso, Majestic Wine warned that trading conditions were deteriorating.\n\nChief executive Rowan Gormley said: \"We expect the UK market to remain tough, possibly even tougher than last year.\n\n\"Certainly trading since year-end has been harder than the prior year in the UK.\"\n\nThe hot weather in May and early June was not good for everyone. Revolution Bars said the warm weather had \"curtailed typical late-night weekend trading\" at its 72 bars.\n\nIt also blamed cold weather in March for a 1.7% fall in like-for-like sales in the first half of the year.\n\nEconomists are divided about the outlook for UK retail sales.\n\nRuth Gregory, senior UK economist at Capital Economics, said the latest data added to evidence that spending had \"picked up some pace following the softness at the start of the year\".\n\n\"With real pay rises in prospect, consumer spending should receive more fundamental support as the year progresses,\" she added.\n\n\"Overall, then, today's figures support our view that annual spending growth should pick up from 1.1% in Q1 to about 2% by early 2019, helping the economy to regain some momentum.\"\n\nHowever, Samuel Tombs, chief UK economist at Pantheon Macroeconomics, said May's sales jump had \"all the hallmarks of a weather-related blip, rather than a sustainable pick-up in spending\".\n\n\"The average level of non-food sales in the first five months of 2018 is exactly the same as in the last five months of 2017, so the underlying trend in sales still looks pretty flat.\"\n\nMay's sales increase was much larger than analysts had expected, and the news pushed up the value of the pound. Sterling was up 0.5% against the dollar at $1.3440."}